/* eslint-disable prettier/prettier */
export type DataProps = {
  caption?: string;
  content?: string;
}

export const data: DataProps[] = [
  {
    caption: '',
    content: 'بسم الله توكلت على الله ولا حول ولا قوة إلا بالله',
  },
  {
    caption: '',
    content: 'اللهم صل على محمد وعلى آل محمد كما صليت على إبراهيم وعلى آل إبراهيم وبارك على محمد وعلى آل محمد كما باركت على إبراهيم وعلى آل ابراهيم في العالمين إنك حميد مجيد',
  },
  {
    caption: '',
    content: 'حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم',
  },
  {
    caption: '',
    content: 'بسم الله الذي لا يضر مع اسمه شيء في الارض ولا في السماء وهو السميع العليم',
  },
  {
    caption: '',
    content: 'اللهم رب الناس أذهب الباس إشفِ أنت الشافي لا شفاء إلا شفاءك شفاءً لا يغادر سقما',
  },
  {
    caption: '',
    content: 'بسم الله ارقيك، من كل شيء يؤذيك، من شر كل نفس أو عين حاسد، الله يشفيك، بسم الله ارقيك',
  },
  {
    caption: '',
    content: 'الله أكبر، الله أكبر، الله أكبر، الله أكبر، أشهد أن لا إله إلا الله، أشهد أن لا إله إلا الله، أشهد أن محمدًا رسولُ الله، أشهد أن محمدًا رسولُ الله، حيَّ على الصلاة، حيَّ على الصلاة، حيَّ على الفلاح، حيَّ على الفلاح، الله أكبر، الله أكبر، لا إله إلا الله',
  },
  {
    caption: '[سورة الفاتحة، آية: 1-7]',
    content: `
    (بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ* الْحَمْدُ لِلَّـهِ رَبِّ الْعَالَمِينَ* الرَّحْمَـٰنِ الرَّحِيمِ* مَالِكِ يَوْمِ الدِّينِ* إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ* اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ* صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ).
    `,
  },
  {
    caption: '[سورة البقرة، آية: 1-5]',
    content: `
    (الم* ذَٰلِكَ الْكِتَابُ لَا رَيْبَ ۛ فِيهِ ۛ هُدًى لِّلْمُتَّقِينَ* الَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ وَيُقِيمُونَ الصَّلَاةَ وَمِمَّا رَزَقْنَاهُمْ يُنفِقُونَ* وَالَّذِينَ يُؤْمِنُونَ بِمَا أُنزِلَ إِلَيْكَ وَمَا أُنزِلَ مِن قَبْلِكَ وَبِالْآخِرَةِ هُمْ يُوقِنُونَ* أُولَـٰئِكَ عَلَىٰ هُدًى مِّن رَّبِّهِمْ ۖ وَأُولَـٰئِكَ هُمُ الْمُفْلِحُونَ).
    `,
  },
  {
    caption: '[ البقرة، آية: 22]',
    content: `
    الَّذِي جَعَلَ لَكُمُ الْأَرْضَ فِرَاشًا وَالسَّمَاءَ بِنَاءً وَأَنْزَلَ مِنَ السَّمَاءِ مَاءً فَأَخْرَجَ بِهِ مِنَ الثَّمَرَاتِ رِزْقًا لَكُمْ ۖ فَلَا تَجْعَلُوا لِلَّهِ أَنْدَادًا وَأَنْتُمْ تَعْلَمُونَ
    `,
  },
  {
    caption: '[سورة البقرة، آية: 255]',
    content: `
    (اللَّـهُ لَا إِلَـٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ).
    `,
  },
  {
    caption: '[سورة البقرة، آية: 255]',
    content: `
    (اللَّـهُ لَا إِلَـٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ).
    `,
  },
  {
    caption: '[سورة البقرة، آية: 102]',
    content: `
    (وَاتَّبَعُوا مَا تَتْلُو الشَّيَاطِينُ عَلَىٰ مُلْكِ سُلَيْمَانَ وَمَا كَفَرَ سُلَيْمَانُ وَلَـٰكِنَّ الشَّيَاطِينَ كَفَرُوا يُعَلِّمُونَ النَّاسَ السِّحْرَ وَمَا أُنزِلَ عَلَى الْمَلَكَيْنِ بِبَابِلَ هَارُوتَ وَمَارُوتَ وَمَا يُعَلِّمَانِ مِنْ أَحَدٍ حَتَّى يَقُولَا إِنَّمَا نَحْنُ فِتْنَةٌ فَلَا تَكْفُرْ فَيَتَعَلَّمُونَ مِنْهُمَا مَا يُفَرِّقُونَ بِهِ بَيْنَ الْمَرْءِ وَزَوْجِهِ وَمَا هُم بِضَارِّينَ بِهِ مِنْ أَحَدٍ إِلَّا بِإِذْنِ اللَّـهِ وَيَتَعَلَّمُونَ مَا يَضُرُّهُمْ وَلَا يَنفَعُهُمْ وَلَقَدْ عَلِمُوا لَمَنِ اشْتَرَاهُ مَا لَهُ فِي الْآخِرَةِ مِنْ خَلَاقٍ وَلَبِئْسَ مَا شَرَوْا بِهِ أَنفُسَهُمْ لَوْ كَانُوا يَعْلَمُونَ).
    `,
  },
  {
    caption: '[سورة آل عمران، آية: 1-5]',
    content: `
    (الم* اللَّـهُ لَا إِلَـٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ* نَزَّلَ عَلَيْكَ الْكِتَابَ بِالْحَقِّ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ وَأَنزَلَ التَّوْرَاةَ وَالْإِنجِيلَ*مِن قَبْلُ هُدًى لِّلنَّاسِ وَأَنزَلَ الْفُرْقَانَ إِنَّ الَّذِينَ كَفَرُوا بِآيَاتِ اللَّـهِ لَهُمْ عَذَابٌ شَدِيدٌ وَاللَّـهُ عَزِيزٌ ذُو انتِقَامٍ* إِنَّ اللَّـهَ لَا يَخْفَىٰ عَلَيْهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ).
    `,
  },
  {
    caption: '[سورة آل عمران، آية: 26-27]',
    content: `
    (قُلِ اللَّـهُمَّ مَالِكَ الْمُلْكِ تُؤْتِي الْمُلْكَ مَن تَشَاءُ وَتَنزِعُ الْمُلْكَ مِمَّن تَشَاءُ وَتُعِزُّ مَن تَشَاءُ وَتُذِلُّ مَن تَشَاءُ بِيَدِكَ الْخَيْرُ إِنَّكَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ* تُولِجُ اللَّيْلَ فِي النَّهَارِ وَتُولِجُ النَّهَارَ فِي اللَّيْلِ وَتُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ وَتُخْرِجُ الْمَيِّتَ مِنَ الْحَيِّ وَتَرْزُقُ مَن تَشَاءُ بِغَيْرِ حِسَابٍ).
    `,
  },
  {
    caption: '[آل عمران 173]',
    content: `
    الَّذِينَ قَالَ لَهُمُ النَّاسُ إِنَّ النَّاسَ قَدْ جَمَعُواْ لَكُمْ فَاخْشَوْهُمْ فَزَادَهُمْ إِيمَاناً وَقَالُواْ حَسْبُنَا اللّهُ وَنِعْمَ الْوَكِيلُ . فَانقَلَبُواْ بِنِعْمَةٍ مِّنَ اللّهِ وَفَضْلٍ لَّمْ يَمْسَسْهُمْ سُوءٌ وَاتَّبَعُواْ رِضْوَانَ اللّهِ وَاللّهُ ذُو فَضْلٍ عَظِيمٍ
    `,
  },
  {
    caption: '[سورة آل عمران، آية: 190-194]',
    content: `
    (إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ وَاخْتِلَافِ اللَّيْلِ وَالنَّهَارِ لَآيَاتٍ لِّأُولِي الْأَلْبَابِ* الَّذِينَ يَذْكُرُونَ اللَّـهَ قِيَامًا وَقُعُودًا وَعَلَىٰ جُنُوبِهِمْ وَيَتَفَكَّرُونَ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ رَبَّنَا مَا خَلَقْتَ هَـٰذَا بَاطِلًا سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ* رَبَّنَا إِنَّكَ مَن تُدْخِلِ النَّارَ فَقَدْ أَخْزَيْتَهُ وَمَا لِلظَّالِمِينَ مِنْ أَنصَارٍ* رَّبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلْإِيمَانِ أَنْ آمِنُوا بِرَبِّكُمْ فَآمَنَّا رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الْأَبْرَارِ* رَبَّنَا وَآتِنَا مَا وَعَدتَّنَا عَلَىٰ رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لَا تُخْلِفُ الْمِيعَادَ).
    `,
  },
  {
    caption: '[سورة الأعراف، آية: 54-55]',
    content: `
    (إِنَّ رَبَّكُمُ اللَّـهُ الَّذي خَلَقَ السَّماواتِ وَالأَرضَ في سِتَّةِ أَيّامٍ ثُمَّ استَوى عَلَى العَرشِ يُغشِي اللَّيلَ النَّهارَ يَطلُبُهُ حَثيثًا وَالشَّمسَ وَالقَمَرَ وَالنُّجومَ مُسَخَّراتٍ بِأَمرِهِ أَلا لَهُ الخَلقُ وَالأَمرُ تَبارَكَ اللَّـهُ رَبُّ العالَمينَ* ادعوا رَبَّكُم تَضَرُّعًا وَخُفيَةً إِنَّهُ لا يُحِبُّ المُعتَدينَ).
    `,
  },
  {
    caption: '[سورة الأعراف، آية: 117-122]',
    content: `
    (وَأَوحَينا إِلى موسى أَن أَلقِ عَصاكَ فَإِذا هِيَ تَلقَفُ ما يَأفِكونَ* فَوَقَعَ الحَقُّ وَبَطَلَ ما كانوا يَعمَلونَ*فَغُلِبوا هُنالِكَ وَانقَلَبوا صاغِرينَ* وَأُلقِيَ السَّحَرَةُ ساجِدينَ*قالوا آمَنّا بِرَبِّ العالَمينَ* رَبِّ موسى وَهارونَ).
    `,
  },
  {
    caption: '[سورة المؤمنون، آية: 115-118]',
    content: `
    (أَفَحَسِبْتُمْ أَنَّمَا خَلَقْنَاكُمْ عَبَثًا وَأَنَّكُمْ إِلَيْنَا لَا تُرْجَعُونَ*فَتَعَالَى اللَّـهُ الْمَلِكُ الْحَقُّ لَا إِلَـهَ إِلَّا هُوَ رَبُّ الْعَرْشِ الْكَرِيمِ* وَمَن يَدْعُ مَعَ اللَّـهِ إِلَـهًا آخَرَ لَا بُرْهَانَ لَهُ بِهِ فَإِنَّمَا حِسَابُهُ عِندَ رَبِّهِ إِنَّهُ لَا يُفْلِحُ الْكَافِرُونَ* وَقُل رَّبِّ اغْفِرْ وَارْحَمْ وَأَنتَ خَيْرُ الرَّاحِمِينَ).
    `,
  },
  {
    caption: '[سورة المؤمنون، آية: 97-98]',
    content: `
    (وَقُل رَّبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ* وَأَعُوذُ بِكَ رَبِّ أَن يَحْضُرُونِ).
    `,
  },
  {
    caption: '[سورة الشعراء، آية: 80]',
    content: `
    (وَإِذَا مَرِضْتُ فَهُوَ يَشْفِينِ).
    `,
  },
  {
    caption: '[الأنبياء 8]',
    content: `
    وَذَا النُّونِ إِذ ذَّهَبَ مُغَاضِبًا فَظَنَّ أَن لَّن نَّقْدِرَ عَلَيْهِ فَنَادَى فِي الظُّلُمَاتِ أَن لَّا إِلَهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ . فَاسْتَجَبْنَا لَهُ وَنَجَّيْنَاهُ مِنَ الْغَمِّ وَكَذَلِكَ نُنجِي الْمُؤْمِنِينَ
    `,
  },
  {
    caption: '[الأنبياء 18]',
    content: `
    بَلۡ نَقۡذِفُ بِالۡحَقِّ عَلَىٰ الۡبَاطِلِ فَيَدۡمَغُهُ فَإِذَا هُوَ زَاهِقٌ وَلَكُمُ الۡوَيۡلُ مِمَّا تَصِفُونَ
    `,
  },
  {
    caption: '[الأنبياء 83]',
    content: `
    وَأَيُّوبَ إِذْ نَادَى رَبَّهُ أَنِّي مَسَّنِيَ الضُّرُّ وَأَنتَ أَرْحَمُ الرَّاحِمِين فَاسْتَجَبْنَا لَهُ فَكَشَفْنَا مَا بِهِ مِن ضُرٍّ وَآتَيْنَاهُ أَهْلَهُ وَمِثْلَهُم مَّعَهُمْ رَحْمَةً مِّنْ عِندِنَا وَذِكْرَى لِلْعَابِدِينَ
    `,
  },
  {
    caption: '[مريم – 68 ، 72]',
    content: `
    فَوَرَبِّكَ لَنَحْشُرَنَّهُمْ وَالشَّيَاطِينَ ثُمَّ لَنُحْضِرَنَّهُمْ حَوْلَ جَهَنَّمَ جِثِيًّا * ثُمَّ لَنَنزِعَنَّ مِنْ كُلِّ شِيعَـــةٍ أَيُّهُـــمْ أَشَــدُّ عَلَى الرَّحْمَنِ عِتِيـًّا * ثُـمَّ لَنَحـْنُ أَعْلَـمُ بِالَّذِينَ هُـمْ أَوْلَى بِهَا صِلِيـًّا * وَإِنْ مِنْكُـمْ إِلا وَارِدُهَا كَانَ عَلَى رَبِّكَ حَتْمًا مَقْضِيًّا * ثُمَّ نُنَجِّى الَّذِينَ اتَّقَوْا وَنَذَرُ الظَّالِمِينَ فِيهَا جِثِيًّا
    `,
  },
  {
    caption: '[إبراهيم – 15 ، 17]',
    content: `
    وَاسْتَفْتَحُوا وَخَابَ كُلُّ جَبَّارٍ عَنِيدٍ * مِنْ وَرَائِهِ جَهَنَّمُ وَيُسْقَى مِنْ مَاءٍ صَدِيدٍ * يَتَجَرَّعُهُ وَلا يَكَادُ يُسِيغُهُ وَيَأْتِيهِ الْمَوْتُ مِنْ كُلِّ مَكَانٍ وَمَا هُوَ بِمَيِّتٍ وَمِنْ وَرَائِهِ عَذَابٌ غَلِيظٌ
    `,
  },
  {
    caption: '[نوح : 10-12]',
    content: `
    فَقُلْتُ اسْتَغْفِرُوا رَبَّكُمْ إِنَّهُ كَانَ غَفَّارًا * يُرْسِلِ السَّمَاء عَلَيْكُم مِّدْرَارًا * وَيُمْدِدْكُمْ بِأَمْوَالٍ وَبَنِينَ وَيَجْعَل لَّكُمْ جَنَّاتٍ وَيَجْعَل لَّكُمْ أَنْهَارًا
    `,
  },
  {
    caption: '[غافر : 44]',
    content: `
    وَأُفَوِّضُ أَمْرِي إِلَى اللَّهِ إِنَّ اللَّهَ بَصِيرٌ بِالْعِبَادِ . فَوَقَاهُ اللَّهُ سَيِّئَاتِ مَا مَكَرُوا وَحَاقَ بِآلِ فِرْعَوْنَ سُوءُ الْعَذَابِ
    `,
  },
  {
    caption: '[طه 69]',
    content: `
    وَأَلْقِ مَا فِي يَمِينِكَ تَلْقَفْ مَا صَنَعُوا إِنَّمَا صَنَعُوا كَيْدُ سَاحِرٍ وَلَا يُفْلِحُ السَّاحِرُ حَيْثُ أَتَى
    `,
  },
  {
    caption: '[طه 105 : 107]',
    content: `
    وَيَسْأَلُونَكَ عَنِ الْجِبَالِ فَقُلْ يَنسِفُهَا رَبِّي نَسْفًا * فَيَذَرُهَا قَاعًا صَفْصَفًا * لَّا تَرَى فِيهَا عِوَجًا وَلَا أَمْتًا
    `,
  },
  {
    caption: '[سورة يونس، آية: 79-82]',
    content: `
    (وَقالَ فِرعَونُ ائتوني بِكُلِّ ساحِرٍ عَليمٍ* فَلَمّا جاءَ السَّحَرَةُ قالَ لَهُم موسى أَلقوا ما أَنتُم مُلقونَ* فَلَمّا أَلقَوا قالَ موسى ما جِئتُم بِهِ السِّحرُ إِنَّ اللَّـهَ سَيُبطِلُهُ إِنَّ اللَّـهَ لا يُصلِحُ عَمَلَ المُفسِدينَ* وَيُحِقُّ اللَّـهُ الحَقَّ بِكَلِماتِهِ وَلَو كَرِهَ المُجرِمونَ).
    `,
  },
  {
    caption: '[سورة الإسراء، آية: 80-82]',
    content: `
    (وَقُل رَبِّ أَدخِلني مُدخَلَ صِدقٍ وَأَخرِجني مُخرَجَ صِدقٍ وَاجعَل لي مِن لَدُنكَ سُلطانًا نَصيرًا* وَقُل جاءَ الحَقُّ وَزَهَقَ الباطِلُ إِنَّ الباطِلَ كانَ زَهوقًا* وَنُنَزِّلُ مِنَ القُرآنِ ما هُوَ شِفاءٌ وَرَحمَةٌ لِلمُؤمِنينَ وَلا يَزيدُ الظّالِمينَ إِلّا خَسارًا).
    `,
  },
  {
    caption: '[سورة الإسراء، آية: 110-111]',
    content: `
    (قُلِ ادعُوا اللَّـهَ أَوِ ادعُوا الرَّحمـنَ أَيًّا ما تَدعوا فَلَهُ الأَسماءُ الحُسنى وَلا تَجهَر بِصَلاتِكَ وَلا تُخافِت بِها وَابتَغِ بَينَ ذلِكَ سَبيلًا* وَقُلِ الحَمدُ لِلَّـهِ الَّذي لَم يَتَّخِذ وَلَدًا وَلَم يَكُن لَهُ شَريكٌ فِي المُلكِ وَلَم يَكُن لَهُ وَلِيٌّ مِنَ الذُّلِّ وَكَبِّرهُ تَكبيرًا).
    `,
  },
  {
    caption: '[سورة الكهف، آية: 39]',
    content: `
    (وَلَولا إِذ دَخَلتَ جَنَّتَكَ قُلتَ ما شاءَ اللَّـهُ لا قُوَّةَ إِلّا بِاللَّـهِ إِن تَرَنِ أَنا أَقَلَّ مِنكَ مالًا وَوَلَدًا).
    `,
  },
  {
    caption: '[سورة النور، آية، 35]',
    content: `
    (اللَّـهُ نُورُ السَّمَاوَاتِ وَالْأَرْضِ مَثَلُ نُورِهِ كَمِشْكَاةٍ فِيهَا مِصْبَاحٌ الْمِصْبَاحُ فِي زُجَاجَةٍ الزُّجَاجَةُ كَأَنَّهَا كَوْكَبٌ دُرِّيٌّ يُوقَدُ مِن شَجَرَةٍ مُّبَارَكَةٍ زَيْتُونَةٍ لَّا شَرْقِيَّةٍ وَلَا غَرْبِيَّةٍ يَكَادُ زَيْتُهَا يُضِيءُ وَلَوْ لَمْ تَمْسَسْهُ نَارٌ نُّورٌ عَلَى نُورٍ يَهْدِي اللَّـهُ لِنُورِهِ مَن يَشَاءُ وَيَضْرِبُ اللَّـهُ الْأَمْثَالَ لِلنَّاسِ وَاللَّـهُ بِكُلِّ شَيْءٍ عَلِيمٌ).
    `,
  },
  {
    caption: '[سورة الحشر، آية: 21-24]',
    content: `
    (لَوْ أَنزَلْنَا هَـذَا الْقُرْآنَ عَلَى جَبَلٍ لَّرَأَيْتَهُ خَاشِعًا مُّتَصَدِّعًا مِّنْ خَشْيَةِ اللَّـهِ وَتِلْكَ الْأَمْثَالُ نَضْرِبُهَا لِلنَّاسِ لَعَلَّهُمْ يَتَفَكَّرُونَ* هُوَ اللَّـهُ الَّذِي لَا إِلَـهَ إِلَّا هُوَ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ هُوَ الرَّحْمَـنُ الرَّحِيمُ* هُوَ اللَّـهُ الَّذِي لَا إِلَـهَ إِلَّا هُوَ الْمَلِكُ الْقُدُّوسُ السَّلَامُ الْمُؤْمِنُ الْمُهَيْمِنُ الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ سُبْحَانَ اللَّـهِ عَمَّا يُشْرِكُونَ* هُوَ اللَّـهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ لَهُ الْأَسْمَاءُ الْحُسْنَى يُسَبِّحُ لَهُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ وَهُوَ الْعَزِيزُ الْحَكِيمُ).
    `,
  },
  {
    caption: '[سورة القلم، آية: 51-52]',
    content: `
    (وَإِن يَكَادُ الَّذِينَ كَفَرُوا لَيُزْلِقُونَكَ بِأَبْصَارِهِمْ لَمَّا سَمِعُوا الذِّكْرَ وَيَقُولُونَ إِنَّهُ لَمَجْنُونٌ* وَمَا هُوَ إِلَّا ذِكْرٌ لِّلْعَالَمِينَ).
    `,
  },
  {
    caption: '[العنكبوت  60]',
    content: `
    و َكَأَيِّنْ مِنْ دَابَّةٍ لَا تَحْمِلُ رِزْقَهَا اللَّهُ يَرْزُقُهَا وَإِيَّاكُمْ ۚ وَهُوَ السَّمِيعُ الْعَلِيمُ
    `,
  },
  {
    caption: '[سورة الشرح، آية: 1-8]',
    content: `
    (أَلَمْ نَشْرَحْ لَكَ صَدْرَكَ* وَوَضَعْنَا عَنكَ وِزْرَكَ* الَّذِي أَنقَضَ ظَهْرَكَ* وَرَفَعْنَا لَكَ ذِكْرَكَ* فَإِنَّ مَعَ الْعُسْرِ يُسْرًا* إِنَّ مَعَ الْعُسْرِ يُسْرًا* فَإِذَا فَرَغْتَ فَانصَبْ* وَإِلَى رَبِّكَ فَارْغَب).
    `,
  },
  {
    caption: '[سورة الصافات، آية: 1-18]',
    content: `
    (وَالصَّافَّاتِ صَفًّا* فَالزَّاجِرَاتِ زَجْرًا* فَالتَّالِيَاتِ ذِكْرًا* إِنَّ إِلَٰهَكُمْ لَوَاحِدٌ* رَّبُّ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا وَرَبُّ الْمَشَارِقِ* إِنَّا زَيَّنَّا السَّمَاءَ الدُّنْيَا بِزِينَةٍ الْكَوَاكِبِ* وَحِفْظًا مِّن كُلِّ شَيْطَانٍ مَّارِدٍ* لَّا يَسَّمَّعُونَ إِلَى الْمَلَإِ الْأَعْلَى وَيُقْذَفُونَ مِن كُلِّ جَانِبٍ* دُحُورًا ۖ وَلَهُمْ عَذَابٌ وَاصِبٌ* إِلَّا مَنْ خَطِفَ الْخَطْفَةَ فَأَتْبَعَهُ شِهَابٌ ثَاقِبٌ* فَاسْتَفْتِهِمْ أَهُمْ أَشَدُّ خَلْقًا أَم مَّنْ خَلَقْنَا ۚ إِنَّا خَلَقْنَاهُم مِّن طِينٍ لَّازِبٍ* بَلْ عَجِبْتَ وَيَسْخَرُونَ* وَإِذَا ذُكِّرُوا لَا يَذْكُرُونَ* وَإِذَا رَأَوْا آيَةً يَسْتَسْخِرُونَ* وَقَالُوا إِنْ هَٰذَا إِلَّا سِحْرٌ مُّبِينٌ* أَإِذَا مِتْنَا وَكُنَّا تُرَابًا وَعِظَامًا أَإِنَّا لَمَبْعُوثُونَ* أَوَآبَاؤُنَا الْأَوَّلُونَ* قُلْ نَعَمْ وَأَنتُمْ دَاخِرُونَ).
    `,
  },
  {
    caption: '[سورة الرحمن، آية: 28-34]',
    content: `
    (فَبِأَيِّ آلَاء رَبِّكُمَا تُكَذِّبَانِ* يَسْأَلُهُ مَن فِي السَّمَاوَاتِ وَالْأَرْضِ كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ* فَبِأَيِّ آلَاء رَبِّكُمَا تُكَذِّبَانِ* سَنَفْرُغُ لَكُمْ أَيُّهَا الثَّقَلَانِ* فَبِأَيِّ آلَاء رَبِّكُمَا تُكَذِّبَانِ* يَا مَعْشَرَ الْجِنِّ وَالْإِنسِ إِنِ اسْتَطَعْتُمْ أَن تَنفُذُوا مِنْ أَقْطَارِ السَّمَاوَاتِ وَالْأَرْضِ فَانفُذُوا لَا تَنفُذُونَ إِلَّا بِسُلْطَانٍ* فَبِأَيِّ آلَاء رَبِّكُمَا تُكَذِّبَانِ).
    `,
  },
  {
    caption: '[سورة الجن، آية: 1-9]',
    content: `
    (قُلْ أُوحِيَ إِلَيَّ أَنَّهُ اسْتَمَعَ نَفَرٌ مِّنَ الْجِنِّ فَقَالُوا إِنَّا سَمِعْنَا قُرْآنًا عَجَبًا* يَهْدِي إِلَى الرُّشْدِ فَآمَنَّا بِهِ ۖ وَلَن نُّشْرِكَ بِرَبِّنَا أَحَدًا* وَأَنَّهُ تَعَالَىٰ جَدُّ رَبِّنَا مَا اتَّخَذَ صَاحِبَةً وَلَا وَلَدًا* وَأَنَّهُ كَانَ يَقُولُ سَفِيهُنَا عَلَى اللهِ شَطَطًا* وَأَنَّا ظَنَنَّا أَن لَّن تَقُولَ الْإِنسُ وَالْجِنُّ عَلَى اللهِ كَذِبًا* وَأَنَّهُ كَانَ رِجَالٌ مِّنَ الْإِنسِ يَعُوذُونَ بِرِجَالٍ مِّنَ الْجِنِّ فَزَادُوهُمْ رَهَقًا* وَأَنَّهُمْ ظَنُّوا كَمَا ظَنَنتُمْ أَن لَّن يَبْعَثَ اللهُ أَحَدًا* وَأَنَّا لَمَسْنَا السَّمَاءَ فَوَجَدْنَاهَا مُلِئَتْ حَرَسًا شَدِيدًا وَشُهُبًا* وَأَنَّا كُنَّا نَقْعُدُ مِنْهَا مَقَاعِدَ لِلسَّمْعِ ۖ فَمَن يَسْتَمِعِ الْآنَ يَجِدْ لَهُ شِهَابًا رَّصَدًا).
    `,
  },
  {
    caption: '[سورة يس، آية: 1-9]',
    content: `
    (يس* وَالْقُرْآنِ الْحَكِيمِ* إِنَّكَ لَمِنَ الْمُرْسَلِينَ* عَلَى صِرَاطٍ مُّسْتَقِيمٍ* تَنزِيلَ الْعَزِيزِ الرَّحِيمِ* لِتُنذِرَ قَوْمًا مَّا أُنذِرَ آبَاؤُهُمْ فَهُمْ غَافِلُونَ* لَقَدْ حَقَّ الْقَوْلُ عَلَى أَكْثَرِهِمْ فَهُمْ لَا يُؤْمِنُونَ* إِنَّا جَعَلْنَا فِي أَعْنَاقِهِمْ أَغْلاَلاً فَهِيَ إِلَى الأَذْقَانِ فَهُم مُّقْمَحُونَ* وَجَعَلْنَا مِن بَيْنِ أَيْدِيهِمْ سَدًّا وَمِنْ خَلْفِهِمْ سَدًّا فَأَغْشَيْنَاهُمْ فَهُمْ لاَ يُبْصِرُونَ).
    `,
  },
  {
    caption: '[سورة فصلت، آية: 36]',
    content: `
    (وَإِمَّا يَنزَغَنَّكَ مِنَ الشَّيْطَانِ نَزْغٌ فَاسْتَعِذْ بِاللَّهِ إِنَّهُ هُوَ السَّمِيعُ الْعَلِيمُ).
    `,
  },
  {
    caption: '[سورة الإخلاص، آية: 1-4]',
    content: `
    (قُلْ هُوَ اللَّـهُ أَحَدٌ* اللَّـهُ الصَّمَدُ* لَمْ يَلِدْ وَلَمْ يُولَدْ* وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ).
    `,
  },
  {
    caption: '[سورة الفلق، آية: 1-5]',
    content: `
    (قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ* مِن شَرِّ مَا خَلَقَ* وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ* وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ* وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ).
    `,
  },
  {
    caption: '[سورة الناس، آية: 1-6]',
    content: `
    (قُلْ أَعُوذُ بِرَبِّ النَّاسِ* مَلِكِ النَّاسِ* إِلَـهِ النَّاسِ* مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ* الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ* مِنَ الْجِنَّةِ وَالنَّاسِ).
    `,
  },
];
