export type Category = 'Morning' | 'Night' | 'BeforeSleep';
type AudioFile = {
  fileName: string;
  title: string;
}
export type DataProps = {
  caption?: string;
  content?: string;
  repeatDescription? : string;
  repeat?: number;
  audioFile?: string;
  category?: Category;
  note?: string;
  audioArray?: AudioFile[];
  isStacked?: boolean;
}

export enum CategoryEnum {
  Morning = 'Morning',
  Night = 'Night',
  BeforeSleep = 'BeforeSleep',
}

export const data: DataProps[] = [
  {
    caption: '[حديث]',
    content: 'بِسْمِ اللهِ، تَوَكَّلْتُ عَلَى اللهِ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللهِ',
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: 'roqia-01.mp3',
  },
  {
    caption: '[حديث]',
    content: 'اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ، كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ، وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ، وَبَارِكْ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ، وَعَلَى آلِ إِبْرَاهِيمَ، فِي الْعَالَمِينَ إِنَّكَ حَمِيدٌ مَجِيدٌ',
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: 'roqia-02.mp3',
  },
  {
    caption: '[حديث]',
    content: 'حَسْبِيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَيهِ تَوَكَّلتُ وَهُوَ رَبُّ العَرْشِ العَظيم',
    repeatDescription: '7 مرات',
    repeat: 7,
    audioFile: 'roqia-03.mp3',
  },
  {
    caption: '[حديث]',
    content: 'بسمِ اللَّهِ الَّذي لا يضرُّ معَ اسمِهِ شيءٌ في الأرضِ ولا في السَّماءِ وَهوَ السَّميعُ العليمُ',
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: 'roqia-04.mp3',
  },
  {
    caption: '[حديث]',
    content: 'اللَّهُمَّ رَبَّ النَّاسِ أَذْهِبِ الْبَاسَ، اشْفِهِ وَأَنْتَ الشَّافِي، لاَ شِفَاءَ إِلاَّ شِفَاؤُكَ، شِفَاءً لاَ يُغَادِرُ سَقَمًا',
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: 'roqia-05.mp3',
  },
  {
    caption: '[حديث]',
    content: 'باسم اللَّه أرقيك، من كلِّ شيءٍ يؤذيك، من شرِّ كلِّ نفسٍ أو عين حاسدٍ، اللَّهُ يشفيك، باسم اللَّه أَرقيك',
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: 'roqia-06.mp3',
  },
  {
    caption: '[الأذان]',
    content: `الله أكبر، الله أكبر،
    الله أكبر، الله أكبر،
    أشهد أن لا إله إلا الله،
    أشهد أن لا إله إلا الله، 
    أشهد أن محمدًا رسولُ الله،
    أشهد أن محمدًا رسولُ الله،
    حيَّ على الصلاة، حيَّ على الصلاة،
    حيَّ على الفلاح، حيَّ على الفلاح،
    الله أكبر، الله أكبر،
    لا إله إلا الله`,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "adan.mp3",
  },
  {
    caption: '[سورة الفاتحة، آية: 1-7]',
    content: `
    {بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ* الْحَمْدُ لِلَّـهِ رَبِّ الْعَالَمِينَ* الرَّحْمَـٰنِ الرَّحِيمِ* مَالِكِ يَوْمِ الدِّينِ* إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ* اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ* صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ}.
    `,
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "fatiha.mp3",
  },
  {
    caption: '[سورة البقرة، آية: 1-5]',
    content: `
    {الم* ذَٰلِكَ الْكِتَابُ لَا رَيْبَ ۛ فِيهِ ۛ هُدًى لِّلْمُتَّقِينَ* الَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ وَيُقِيمُونَ الصَّلَاةَ وَمِمَّا رَزَقْنَاهُمْ يُنفِقُونَ* وَالَّذِينَ يُؤْمِنُونَ بِمَا أُنزِلَ إِلَيْكَ وَمَا أُنزِلَ مِن قَبْلِكَ وَبِالْآخِرَةِ هُمْ يُوقِنُونَ* أُولَـٰئِكَ عَلَىٰ هُدًى مِّن رَّبِّهِمْ ۖ وَأُولَـٰئِكَ هُمُ الْمُفْلِحُونَ}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة البقرة، آية: 255]',
    content: `
    {اللَّـهُ لَا إِلَـٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ}.
    `,
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "1.mp3"
  },
  {
    caption: '[سورة البقرة، آية: 102]',
    content: `
    {وَاتَّبَعُوا مَا تَتْلُو الشَّيَاطِينُ عَلَىٰ مُلْكِ سُلَيْمَانَ وَمَا كَفَرَ سُلَيْمَانُ وَلَـٰكِنَّ الشَّيَاطِينَ كَفَرُوا يُعَلِّمُونَ النَّاسَ السِّحْرَ وَمَا أُنزِلَ عَلَى الْمَلَكَيْنِ بِبَابِلَ هَارُوتَ وَمَارُوتَ وَمَا يُعَلِّمَانِ مِنْ أَحَدٍ حَتَّى يَقُولَا إِنَّمَا نَحْنُ فِتْنَةٌ فَلَا تَكْفُرْ فَيَتَعَلَّمُونَ مِنْهُمَا مَا يُفَرِّقُونَ بِهِ بَيْنَ الْمَرْءِ وَزَوْجِهِ وَمَا هُم بِضَارِّينَ بِهِ مِنْ أَحَدٍ إِلَّا بِإِذْنِ اللَّـهِ وَيَتَعَلَّمُونَ مَا يَضُرُّهُمْ وَلَا يَنفَعُهُمْ وَلَقَدْ عَلِمُوا لَمَنِ اشْتَرَاهُ مَا لَهُ فِي الْآخِرَةِ مِنْ خَلَاقٍ وَلَبِئْسَ مَا شَرَوْا بِهِ أَنفُسَهُمْ لَوْ كَانُوا يَعْلَمُونَ}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة البقرة، آية: 285-286]',
    content: `
    {آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ وَقَالُوا سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ ۝ لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "37.mp3",
  },
  {
    caption: '[سورة آل عمران، آية: 1-5]',
    content: `
    {الم* اللَّـهُ لَا إِلَـٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ* نَزَّلَ عَلَيْكَ الْكِتَابَ بِالْحَقِّ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ وَأَنزَلَ التَّوْرَاةَ وَالْإِنجِيلَ*مِن قَبْلُ هُدًى لِّلنَّاسِ وَأَنزَلَ الْفُرْقَانَ إِنَّ الَّذِينَ كَفَرُوا بِآيَاتِ اللَّـهِ لَهُمْ عَذَابٌ شَدِيدٌ وَاللَّـهُ عَزِيزٌ ذُو انتِقَامٍ* إِنَّ اللَّـهَ لَا يَخْفَىٰ عَلَيْهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة آل عمران، آية: 26-27]',
    content: `
    {قُلِ اللَّـهُمَّ مَالِكَ الْمُلْكِ تُؤْتِي الْمُلْكَ مَن تَشَاءُ وَتَنزِعُ الْمُلْكَ مِمَّن تَشَاءُ وَتُعِزُّ مَن تَشَاءُ وَتُذِلُّ مَن تَشَاءُ بِيَدِكَ الْخَيْرُ إِنَّكَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ* تُولِجُ اللَّيْلَ فِي النَّهَارِ وَتُولِجُ النَّهَارَ فِي اللَّيْلِ وَتُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ وَتُخْرِجُ الْمَيِّتَ مِنَ الْحَيِّ وَتَرْزُقُ مَن تَشَاءُ بِغَيْرِ حِسَابٍ}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة الأعراف، آية: 117-122]',
    content: `
    {وَأَوحَينا إِلى موسى أَن أَلقِ عَصاكَ فَإِذا هِيَ تَلقَفُ ما يَأفِكونَ* فَوَقَعَ الحَقُّ وَبَطَلَ ما كانوا يَعمَلونَ*فَغُلِبوا هُنالِكَ وَانقَلَبوا صاغِرينَ* وَأُلقِيَ السَّحَرَةُ ساجِدينَ*قالوا آمَنّا بِرَبِّ العالَمينَ* رَبِّ موسى وَهارونَ}.
    `,
    repeatDescription: '3 مرات',
    repeat: 3,
  },
  {
    caption: '[طه 69]',
    content: `
    {وَأَلْقِ مَا فِي يَمِينِكَ تَلْقَفْ مَا صَنَعُوا إِنَّمَا صَنَعُوا كَيْدُ سَاحِرٍ وَلَا يُفْلِحُ السَّاحِرُ حَيْثُ أَتَى}
    `,
    repeatDescription: '3 مرات',
    repeat: 3,
  },
  {
    caption: '[سورة يونس، آية: 79-82]',
    content: `
    {وَقالَ فِرعَونُ ائتوني بِكُلِّ ساحِرٍ عَليمٍ* فَلَمّا جاءَ السَّحَرَةُ قالَ لَهُم موسى أَلقوا ما أَنتُم مُلقونَ* فَلَمّا أَلقَوا قالَ موسى ما جِئتُم بِهِ السِّحرُ إِنَّ اللَّـهَ سَيُبطِلُهُ إِنَّ اللَّـهَ لا يُصلِحُ عَمَلَ المُفسِدينَ* وَيُحِقُّ اللَّـهُ الحَقَّ بِكَلِماتِهِ وَلَو كَرِهَ المُجرِمونَ}.
    `,
    repeatDescription: '3 مرات',
    repeat: 3,
  },
  {
    caption: '[سورة المؤمنون، آية: 97-98]',
    content: `
    {وَقُل رَّبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ* وَأَعُوذُ بِكَ رَبِّ أَن يَحْضُرُونِ}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[الأنبياء 8]',
    content: `
    {وَذَا النُّونِ إِذ ذَّهَبَ مُغَاضِبًا فَظَنَّ أَن لَّن نَّقْدِرَ عَلَيْهِ فَنَادَى فِي الظُّلُمَاتِ أَن لَّا إِلَهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ . فَاسْتَجَبْنَا لَهُ وَنَجَّيْنَاهُ مِنَ الْغَمِّ وَكَذَلِكَ نُنجِي الْمُؤْمِنِينَ}
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[الأنبياء 83]',
    content: `
    {وَأَيُّوبَ إِذْ نَادَى رَبَّهُ أَنِّي مَسَّنِيَ الضُّرُّ وَأَنتَ أَرْحَمُ الرَّاحِمِين فَاسْتَجَبْنَا لَهُ فَكَشَفْنَا مَا بِهِ مِن ضُرٍّ وَآتَيْنَاهُ أَهْلَهُ وَمِثْلَهُم مَّعَهُمْ رَحْمَةً مِّنْ عِندِنَا وَذِكْرَى لِلْعَابِدِينَ}
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[مريم – 68 ، 72]',
    content: `
    {فَوَرَبِّكَ لَنَحْشُرَنَّهُمْ وَالشَّيَاطِينَ ثُمَّ لَنُحْضِرَنَّهُمْ حَوْلَ جَهَنَّمَ جِثِيًّا * ثُمَّ لَنَنزِعَنَّ مِنْ كُلِّ شِيعَـــةٍ أَيُّهُـــمْ أَشَــدُّ عَلَى الرَّحْمَنِ عِتِيـًّا * ثُـمَّ لَنَحـْنُ أَعْلَـمُ بِالَّذِينَ هُـمْ أَوْلَى بِهَا صِلِيـًّا * وَإِنْ مِنْكُـمْ إِلا وَارِدُهَا كَانَ عَلَى رَبِّكَ حَتْمًا مَقْضِيًّا * ثُمَّ نُنَجِّى الَّذِينَ اتَّقَوْا وَنَذَرُ الظَّالِمِينَ فِيهَا جِثِيًّا}
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[إبراهيم – 15 ، 17]',
    content: `
    {وَاسْتَفْتَحُوا وَخَابَ كُلُّ جَبَّارٍ عَنِيدٍ * مِنْ وَرَائِهِ جَهَنَّمُ وَيُسْقَى مِنْ مَاءٍ صَدِيدٍ * يَتَجَرَّعُهُ وَلا يَكَادُ يُسِيغُهُ وَيَأْتِيهِ الْمَوْتُ مِنْ كُلِّ مَكَانٍ وَمَا هُوَ بِمَيِّتٍ وَمِنْ وَرَائِهِ عَذَابٌ غَلِيظٌ}
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[غافر : 44]',
    content: `
    {وَأُفَوِّضُ أَمْرِي إِلَى اللَّهِ إِنَّ اللَّهَ بَصِيرٌ بِالْعِبَادِ . فَوَقَاهُ اللَّهُ سَيِّئَاتِ مَا مَكَرُوا وَحَاقَ بِآلِ فِرْعَوْنَ سُوءُ الْعَذَابِ}
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة الإسراء، آية: 80-82]',
    content: `
    {وَقُل رَبِّ أَدخِلني مُدخَلَ صِدقٍ وَأَخرِجني مُخرَجَ صِدقٍ وَاجعَل لي مِن لَدُنكَ سُلطانًا نَصيرًا* وَقُل جاءَ الحَقُّ وَزَهَقَ الباطِلُ إِنَّ الباطِلَ كانَ زَهوقًا* وَنُنَزِّلُ مِنَ القُرآنِ ما هُوَ شِفاءٌ وَرَحمَةٌ لِلمُؤمِنينَ وَلا يَزيدُ الظّالِمينَ إِلّا خَسارًا}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة النور، آية، 35]',
    content: `
    {اللَّـهُ نُورُ السَّمَاوَاتِ وَالْأَرْضِ مَثَلُ نُورِهِ كَمِشْكَاةٍ فِيهَا مِصْبَاحٌ الْمِصْبَاحُ فِي زُجَاجَةٍ الزُّجَاجَةُ كَأَنَّهَا كَوْكَبٌ دُرِّيٌّ يُوقَدُ مِن شَجَرَةٍ مُّبَارَكَةٍ زَيْتُونَةٍ لَّا شَرْقِيَّةٍ وَلَا غَرْبِيَّةٍ يَكَادُ زَيْتُهَا يُضِيءُ وَلَوْ لَمْ تَمْسَسْهُ نَارٌ نُّورٌ عَلَى نُورٍ يَهْدِي اللَّـهُ لِنُورِهِ مَن يَشَاءُ وَيَضْرِبُ اللَّـهُ الْأَمْثَالَ لِلنَّاسِ وَاللَّـهُ بِكُلِّ شَيْءٍ عَلِيمٌ}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة يس، آية: 1-9]',
    content: `
    {يس* وَالْقُرْآنِ الْحَكِيمِ* إِنَّكَ لَمِنَ الْمُرْسَلِينَ* عَلَى صِرَاطٍ مُّسْتَقِيمٍ* تَنزِيلَ الْعَزِيزِ الرَّحِيمِ* لِتُنذِرَ قَوْمًا مَّا أُنذِرَ آبَاؤُهُمْ فَهُمْ غَافِلُونَ* لَقَدْ حَقَّ الْقَوْلُ عَلَى أَكْثَرِهِمْ فَهُمْ لَا يُؤْمِنُونَ* إِنَّا جَعَلْنَا فِي أَعْنَاقِهِمْ أَغْلاَلاً فَهِيَ إِلَى الأَذْقَانِ فَهُم مُّقْمَحُونَ* وَجَعَلْنَا مِن بَيْنِ أَيْدِيهِمْ سَدًّا وَمِنْ خَلْفِهِمْ سَدًّا فَأَغْشَيْنَاهُمْ فَهُمْ لاَ يُبْصِرُونَ}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة الصافات، آية: 1-18]',
    content: `
    {وَالصَّافَّاتِ صَفًّا* فَالزَّاجِرَاتِ زَجْرًا* فَالتَّالِيَاتِ ذِكْرًا* إِنَّ إِلَٰهَكُمْ لَوَاحِدٌ* رَّبُّ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا وَرَبُّ الْمَشَارِقِ* إِنَّا زَيَّنَّا السَّمَاءَ الدُّنْيَا بِزِينَةٍ الْكَوَاكِبِ* وَحِفْظًا مِّن كُلِّ شَيْطَانٍ مَّارِدٍ* لَّا يَسَّمَّعُونَ إِلَى الْمَلَإِ الْأَعْلَى وَيُقْذَفُونَ مِن كُلِّ جَانِبٍ* دُحُورًا ۖ وَلَهُمْ عَذَابٌ وَاصِبٌ* إِلَّا مَنْ خَطِفَ الْخَطْفَةَ فَأَتْبَعَهُ شِهَابٌ ثَاقِبٌ* فَاسْتَفْتِهِمْ أَهُمْ أَشَدُّ خَلْقًا أَم مَّنْ خَلَقْنَا ۚ إِنَّا خَلَقْنَاهُم مِّن طِينٍ لَّازِبٍ* بَلْ عَجِبْتَ وَيَسْخَرُونَ* وَإِذَا ذُكِّرُوا لَا يَذْكُرُونَ* وَإِذَا رَأَوْا آيَةً يَسْتَسْخِرُونَ* وَقَالُوا إِنْ هَٰذَا إِلَّا سِحْرٌ مُّبِينٌ* أَإِذَا مِتْنَا وَكُنَّا تُرَابًا وَعِظَامًا أَإِنَّا لَمَبْعُوثُونَ* أَوَآبَاؤُنَا الْأَوَّلُونَ* قُلْ نَعَمْ وَأَنتُمْ دَاخِرُونَ}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة الصافات، آية: 177-182]',
    content: `
    {فَإِذَا نَزَلَ بِسَاحَتِهِمْ فَسَاء صَبَاحُ الْمُنذَرِينَ * وَتَوَلَّ عَنْهُمْ حَتَّى حِينٍ * وَأَبْصِرْ فَسَوْفَ يُبْصِرُونَ * سُبْحَانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ * وَسَلامٌ عَلَى الْمُرْسَلِينَ * وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ *}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة الجن، آية: 1-9]',
    content: `
    {قُلْ أُوحِيَ إِلَيَّ أَنَّهُ اسْتَمَعَ نَفَرٌ مِّنَ الْجِنِّ فَقَالُوا إِنَّا سَمِعْنَا قُرْآنًا عَجَبًا* يَهْدِي إِلَى الرُّشْدِ فَآمَنَّا بِهِ ۖ وَلَن نُّشْرِكَ بِرَبِّنَا أَحَدًا* وَأَنَّهُ تَعَالَىٰ جَدُّ رَبِّنَا مَا اتَّخَذَ صَاحِبَةً وَلَا وَلَدًا* وَأَنَّهُ كَانَ يَقُولُ سَفِيهُنَا عَلَى اللهِ شَطَطًا* وَأَنَّا ظَنَنَّا أَن لَّن تَقُولَ الْإِنسُ وَالْجِنُّ عَلَى اللهِ كَذِبًا* وَأَنَّهُ كَانَ رِجَالٌ مِّنَ الْإِنسِ يَعُوذُونَ بِرِجَالٍ مِّنَ الْجِنِّ فَزَادُوهُمْ رَهَقًا* وَأَنَّهُمْ ظَنُّوا كَمَا ظَنَنتُمْ أَن لَّن يَبْعَثَ اللهُ أَحَدًا* وَأَنَّا لَمَسْنَا السَّمَاءَ فَوَجَدْنَاهَا مُلِئَتْ حَرَسًا شَدِيدًا وَشُهُبًا* وَأَنَّا كُنَّا نَقْعُدُ مِنْهَا مَقَاعِدَ لِلسَّمْعِ ۖ فَمَن يَسْتَمِعِ الْآنَ يَجِدْ لَهُ شِهَابًا رَّصَدًا}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة الطارق، آية 1-17]',
    content: `
    {وَٱلسَّمَآءِ وَٱلطَّارِقِ  * وَمَآ أَدۡرَىٰكَ مَا ٱلطَّارِقُ *  ٱلنَّجۡمُ ٱلثَّاقِبُ * إِن كُلُّ نَفۡسٖ لَّمَّا عَلَيۡهَا حَافِظٞ * فَلۡيَنظُرِ ٱلۡإِنسَٰنُ مِمَّ خُلِقَ * خُلِقَ مِن مَّآءٖ دَافِقٖ * يَخۡرُجُ مِنۢ بَيۡنِ ٱلصُّلۡبِ وَٱلتَّرَآئِبِ * إِنَّهُۥ عَلَىٰ رَجۡعِهِۦ لَقَادِرٞ * يَوۡمَ تُبۡلَى ٱلسَّرَآئِرُ * فَمَا لَهُۥ مِن قُوَّةٖ وَلَا نَاصِرٖ * وَٱلسَّمَآءِ ذَاتِ ٱلرَّجۡعِ * وَٱلۡأَرۡضِ ذَاتِ ٱلصَّدۡعِ * إِنَّهُۥ لَقَوۡلٞ فَصۡلٞ * وَمَا هُوَ بِٱلۡهَزۡلِ * إِنَّهُمۡ يَكِيدُونَ كَيۡدٗا * وَأَكِيدُ كَيۡدٗا * فَمَهِّلِ ٱلۡكَٰفِرِينَ أَمۡهِلۡهُمۡ رُوَيۡدَۢا *}
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة الحشر آية: 21-24]',
    content: `
    {لَوۡ أَنزَلۡنَا هَٰذَا ٱلۡقُرۡءَانَ عَلَىٰ جَبَلٖ لَّرَأَيۡتَهُۥ خَٰشِعٗا مُّتَصَدِّعٗا مِّنۡ خَشۡيَةِ ٱللَّهِۚ وَتِلۡكَ ٱلۡأَمۡثَٰلُ نَضۡرِبُهَا لِلنَّاسِ لَعَلَّهُمۡ يَتَفَكَّرُونَ * هُوَ ٱللَّهُ ٱلَّذِي لَآ إِلَٰهَ إِلَّا هُوَۖ عَٰلِمُ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِۖ هُوَ ٱلرَّحۡمَٰنُ ٱلرَّحِيمُ * هُوَ ٱللَّهُ ٱلَّذِي لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡمَلِكُ ٱلۡقُدُّوسُ ٱلسَّلَٰمُ ٱلۡمُؤۡمِنُ ٱلۡمُهَيۡمِنُ ٱلۡعَزِيزُ ٱلۡجَبَّارُ ٱلۡمُتَكَبِّرُۚ سُبۡحَٰنَ ٱللَّهِ عَمَّا يُشۡرِكُونَ * هُوَ ٱللَّهُ ٱلۡخَٰلِقُ ٱلۡبَارِئُ ٱلۡمُصَوِّرُۖ لَهُ ٱلۡأَسۡمَآءُ ٱلۡحُسۡنَىٰۚ يُسَبِّحُ لَهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ *}
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة الشرح، آية: 1-8]',
    content: `
    {أَلَمْ نَشْرَحْ لَكَ صَدْرَكَ* وَوَضَعْنَا عَنكَ وِزْرَكَ* الَّذِي أَنقَضَ ظَهْرَكَ* وَرَفَعْنَا لَكَ ذِكْرَكَ* فَإِنَّ مَعَ الْعُسْرِ يُسْرًا* إِنَّ مَعَ الْعُسْرِ يُسْرًا* فَإِذَا فَرَغْتَ فَانصَبْ* وَإِلَى رَبِّكَ فَارْغَب}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "094.mp3"
  },
  {
    caption: '[سورة النساء، آية:56]',
    content: `
    { إِنَّ الَّذِينَ كَفَرُوا بِآيَاتِنَا سَوْفَ نُصْلِيهِمْ نَاراً كُلَّمَا نَضِجَتْ جُلُودُهُمْ بَدَّلْنَاهُمْ جُلُوداً غَيْرَهَا لِيَذُوقُوا الْعَذَابَ, إِنَّ اللَّهَ كَانَ عَزِيزاً حَكِيماً}
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة الأنفال، آية:50]',
    content: `
    {وَلَوْ تَرَى إِذْ يَتَوَفَّى الَّذِينَ كَفَرُواْ الْمَلآئِكَةُ يَضْرِبُونَ وُجُوهَهُمْ وَأَدْبَارَهُمْ وَذُوقُواْ عَذَابَ الْحَرِيـقِ}
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة الكافرون، آية: 1-6]',
    content: `
    {قُلۡ يَٰٓأَيُّهَا ٱلۡكَٰفِرُونَ  لَآ أَعۡبُدُ مَا تَعۡبُدُونَ  وَلَآ أَنتُمۡ عَٰبِدُونَ مَآ أَعۡبُدُ  وَلَآ أَنَا۠ عَابِدٞ مَّا عَبَدتُّمۡ  وَلَآ أَنتُمۡ عَٰبِدُونَ مَآ أَعۡبُدُ  لَكُمۡ دِينُكُمۡ وَلِيَ دِينِ}.
    `,
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "38.mp3"
  },
  {
    caption: '[قُلْ هُوَ اللهُ أَحَدٌ]',
    content: `
    {قُلْ هُوَ اللَّـهُ أَحَدٌ* اللَّـهُ الصَّمَدُ* لَمْ يَلِدْ وَلَمْ يُولَدْ* وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ}.
    `,
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "2.mp3"
  },
  {
    caption: '[قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ]',
    content: `
    {قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ* مِن شَرِّ مَا خَلَقَ* وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ* وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ* وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ}.
    `,
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "3.mp3"
  },
  {
    caption: '[قُلْ أَعُوذُ بِرَبِّ النَّاسِ]',
    content: `
    {قُلْ أَعُوذُ بِرَبِّ النَّاسِ* مَلِكِ النَّاسِ* إِلَـهِ النَّاسِ* مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ* الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ* مِنَ الْجِنَّةِ وَالنَّاسِ}.
    `,
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "4.mp3"
  },
];

export const noteData = {
  title: 'ضوابط الرقية الشرعية',
  content: `
  يجب أن تكون على وضوء ويفضل التوجه نحو القبلة

  الإعتقاد بأن الله هو شافى وليست الرقية بذاتها فما هي إلا أخذ بلأسباب

  الدعاء لله وبالله وأسمائه فقط، لا باسم النبي أو ملاك أو أحد الأنبياء أو الصالحين
  `,
  contact: `
  هذا التطبيق غير ربحي بالمرة، قمت بتصميمه من أجل استعمال خاص لي فقط، إذ كان هناك أي خطأ أو ملاحظة يمكنكم التواصل معي عبر البريد
  `,
  email: 'mouradbougarne@gmail.com',
  policyUrl: 'https://roqia.name/privacy',
  termsUrl: 'https://roqia.name/terms',
  githubRepoUrl: 'https://github.com/mbougarne/roqia',
  authorGithubUrl: 'https://github.com/mbougarne',
  audioSourceOneUrl: 'https://alazkar.today/',
  audioSourceTwoUrl: 'https://www.mp3quran.net/ar',
  audioSourceThreeUrl: 'https://lahajati.ai/',
};

export const adkarData: DataProps[] = [
  {
    category: CategoryEnum.Morning,
    caption: '[سورة البقرة: 255]',
    content: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم اللّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: '1.mp3'
  },
  {
    category: CategoryEnum.Morning,
    caption: '[قُلْ هُوَ اللهُ أَحَدٌ]',
    content: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلۡ هُوَ ٱللَّهُ أَحَدٌ ﴿١﴾ ٱللَّهُ ٱلصَّمَدُ ﴿٢﴾ لَمۡ يَلِدۡ وَلَمۡ يُولَدۡ ﴿٣﴾ وَلَمۡ يَكُن لَّهُۥ كُفُوًا أَحَدُۢ ﴿٤﴾",
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: '2.mp3'
  },
  {
    category: CategoryEnum.Morning,
    caption: '[قُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ]',
    content: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ ﴿١﴾ مِن شَرِّ مَا خَلَقَ ﴿٢﴾ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ﴿٣﴾ وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِي ٱلۡعُقَدِ ﴿٤﴾ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ ﴿٥﴾",
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "3.mp3"
  },
  {
    category: CategoryEnum.Morning,
    caption: '[قُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ]',
    content: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ ﴿١﴾ مَلِكِ ٱلنَّاسِ ﴿٢﴾ إِلَٰهِ ٱلنَّاسِ ﴿٣﴾ مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ ﴿٤﴾ ٱلَّذِي يُوَسۡوِسُ فِي صُدُورِ ٱلنَّاسِ ﴿٥﴾ مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ ﴿٦﴾",
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "4.mp3"
  },
  {
    category: CategoryEnum.Morning,
    caption: '[رواه مسلم]',
    content: "أَصْبَحْنا وَأَصْبَحَ المُلْكُ لله وَالحَمدُ لله، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، وهُوَ على كلّ شَيءٍ قدير، رَبِّ أسْأَلُكَ خَيرَ ما في هذا اليوم وَخَيرَ ما بَعْدَه، وَأَعوذُ بِكَ مِنْ شَرِّ ما في هذا اليوم وَشَرِّ ما بَعْدَه، رَبِّ أَعوذُ بِكَ مِنَ الْكَسَلِ وَسوءِ الْكِبَر، رَبِّ أَعوذُ بِكَ مِنْ عَذابٍ في النّارِ وَعَذابٍ في القَبْر.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "sabah-01.mp3"
  },
  {
    category: CategoryEnum.Morning,
    caption: '[سيد الاستغفار - رواه البخاري]',
    content: "اللّهمَّ أَنْتَ رَبِّي لا إلهَ إلاّ أَنْتَ، خَلَقْتَني وَأَنا عَبْدُك، وَأَنا عَلى عَهْدِكَ وَوَعْدِكَ ما اسْتَطَعْت، أَعوذُبِكَ مِنْ شَرِّ ما صَنَعْت، أَبوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبوءُ بِذَنْبي فَاغْفِرْ لي فَإِنَّهُ لا يَغْفِرُ الذُّنوبَ إِلاّ أَنْتَ.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "sabah-02.mp3"
  },
  {
    category: CategoryEnum.Morning,
    caption: '[رواه الترمذي]',
    content: "اللّهُمَّ إِنِّي أَصْبَحْتُ أُشْهِدُك، وَأُشْهِدُ حَمَلَةَ عَرْشِك، وَمَلائِكَتِك، وَجَميعَ خَلْقِك، أَنَّكَ أَنْتَ اللهُ لا إلهَ إلاّ أَنْتَ وَحْدَكَ لا شَريكَ لَك، وَأَنَّ مُحَمّداً عَبْدُكَ وَرَسولُك.",
    repeatDescription: '4 مرات',
    repeat: 4,
    audioFile: "sabah-03.mp3"
  },
  {
    category: CategoryEnum.Morning,
    caption: '[رواه أبو داود]',
    content: "اللّهُمَّ ما أَصْبَحَ بي مِنْ نِعْمَةٍ أَو بِأَحَدٍ مِنْ خَلْقِك، فَمِنْكَ وَحْدَكَ لا شريكَ لَك، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْر.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "sabah-04.mp3"
  },
  {
    category: CategoryEnum.Morning,
    caption: '[رواه ابن السني]',
    content: "حَسْبِيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَيهِ تَوَكَّلتُ وَهُوَ رَبُّ العَرْشِ العَظيم.",
    repeatDescription: '7 مرات',
    repeat: 7,
    audioFile: "sabah-05.mp3"
  },
  {
    category: CategoryEnum.Morning,
    caption: '[رواه أبو داود والترمذي]',
    content: "بِسمِ اللهِ الذي لا يَضُرُّ مَعَ اسمِهِ شَيءٌ في الأرْضِ وَلا في السّماءِ وَهوَ السّميعُ العَليم.",
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "sabah-06.mp3"
  },
  {
    category: CategoryEnum.Morning,
    caption: '[رواه الترمذي]',
    content: "اللّهُمَّ بِكَ أَصْبَحْنا وَبِكَ أَمْسَينا، وَبِكَ نَحْيا وَبِكَ نَمُوتُ وَإِلَيْكَ النُّشُور.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "sabah-07.mp3"
  },
  {
    category: CategoryEnum.Morning,
    caption: '[رواه أحمد]',
    content: "أَصْبَحْنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "sabah-08.mp3"
  },
  {
    category: CategoryEnum.Morning,
    caption: '[رواه الحاكم]',
    content: "سُبْحانَ اللهِ وَبِحَمْدِهِ عَدَدَ خَلْقِه، وَرِضا نَفْسِه، وَزِنَةَ عَرْشِه، وَمِدادَ كَلِماتِه.",
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "sabah-09.mp3"
  },
  {
    category: CategoryEnum.Morning,
    caption: '[رواه الترمذي]',
    content: "يا حَيُّ يا قَيّومُ بِرَحْمَتِكِ أَسْتَغيث، أَصْلِحْ لي شَأْني كُلَّه، وَلا تَكِلني إِلى نَفْسي طَرْفَةَ عَيْن.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "sabah-10.mp3"
  },
  {
    category: CategoryEnum.Morning,
    caption: '[رواه أبو داود]',
    content: "اللّهُمَّ عافِني في بَدَني، اللّهُمَّ عافِني في سَمْعي، اللّهُمَّ عافِني في بَصَري، لا إلهَ إلاّ أَنْتَ.",
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "sabah-11.mp3"

  },
  {
    category: CategoryEnum.Morning,
    caption: '[رواه النسائي]',
    content: " اللّهُمَّ إِنّي أَعوذُ بِكَ مِنَ الْكُفْر، وَالفَقْر، وَأَعوذُ بِكَ مِنْ عَذابِ القَبْر، لا إلهَ إلاّ أَنْتَ.",
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "sabah-12.mp3"

  },
  {
    category: CategoryEnum.Morning,
    caption: '[رواه البخاري ومسلم]',
    content: "لا إلهَ إلاّ اللّهُ وحْدَهُ لا شَريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، وهُوَ على كُلّ شَيءٍ قَدير.",
    repeatDescription: '100 مرة',
    repeat: 100,
    audioFile: "sabah-13.mp3"
  },
  {
    category: CategoryEnum.Morning,
    caption: '[رواه مسلم]',
    content: "سُبْحانَ اللهِ وَبِحَمْدِهِ.",
    repeatDescription: '100 مرة',
    repeat: 100,
    audioFile: "sabah-14.mp3"
  },
  {
    category: CategoryEnum.Morning,
    caption: '[رواه البخاري ومسلم]',
    content: "أَسْتَغْفِرُ اللهَ وَأَتُوبُ إِلَيْهِ.",
    repeatDescription: '100 مرة',
    repeat: 100,
    audioFile: "sabah-15.mp3"
  },
  {
    category: CategoryEnum.Morning,
    caption: '[رواه الطبراني]',
    content: "اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى نَبِيِّنَا مُحمَّد.",
    repeatDescription: '10 مرات',
    repeat: 10,
    audioFile: "sabah-16.mp3"
  },
  // ==========================================
  // أذكار المساء (Night)
  // ==========================================
  {
    category: CategoryEnum.Night,
    caption: '[سورة البقرة: 255]',
    content: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم اللّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "1.mp3"
  },
  {
    category: CategoryEnum.Night,
    caption: '[قُلْ هُوَ اللهُ أَحَدٌ]',
    content: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلۡ هُوَ ٱللَّهُ أَحَدٌ ﴿١﴾ ٱللَّهُ ٱلصَّمَدُ ﴿٢﴾ لَمۡ يَلِدۡ وَلَمۡ يُولَدۡ ﴿٣﴾ وَلَمۡ يَكُن لَّهُۥ كُفُوًا أَحَدُۢ ﴿٤﴾",
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "2.mp3"
  },
  {
    category: CategoryEnum.Night,
    caption: '[قُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ]',
    content: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ ﴿١﴾ مِن شَرِّ مَا خَلَقَ ﴿٢﴾ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ﴿٣﴾ وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِي ٱلۡعُقَدِ ﴿٤﴾ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ ﴿٥﴾",
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "3.mp3"
  },
  {
    category: CategoryEnum.Night,
    caption: '[قُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ]',
    content: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ ﴿١﴾ مَلِكِ ٱلنَّاسِ ﴿٢﴾ إِلَٰهِ ٱلنَّاسِ ﴿٣﴾ مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ ﴿٤﴾ ٱلَّذِي يُوَسۡوِسُ فِي صُدُورِ ٱلنَّاسِ ﴿٥﴾ مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ ﴿٦﴾",
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "4.mp3"
  },
  {
    category: CategoryEnum.Night,
    caption: '[رواه مسلم]',
    content: "أَمْسَيْنا وَأَمْسَى المُلْكُ لله وَالحَمدُ لله، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، وهُوَ على كلّ شَيءٍ قدير، رَبِّ أسْأَلُكَ خَيرَ ما في هذهِ اللَّيْلَةِ وَخَيرَ ما بَعْدَها، وَأَعوذُ بِكَ مِنْ شَرِّ ما في هذهِ اللَّيْلَةِ وَشَرِّ ما بَعْدَها، رَبِّ أَعوذُ بِكَ مِنَ الْكَسَلِ وَسوءِ الْكِبَر، رَبِّ أَعوذُ بِكَ مِنْ عَذابٍ في النّارِ وَعَذابٍ في القَبْر.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "masaa-01.mp3"
  },
  {
    category: CategoryEnum.Night,
    caption: '[رواه البخاري]',
    content: "اللّهمَّ أَنْتَ رَبِّي لا إلهَ إلاّ أَنْتَ، خَلَقْتَني وَأَنا عَبْدُك، وَأَنا عَلى عَهْدِكَ وَوَعْدِكَ ما اسْتَطَعْت، أَعوذُبِكَ مِنْ شَرِّ ما صَنَعْت، أَبوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبوءُ بِذَنْبي فَاغْفِرْ لي فَإِنَّهُ لا يَغْفِرُ الذُّنوبَ إِلاّ أَنْتَ.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "sabah-02.mp3"
  },
  {
    category: CategoryEnum.Night,
    caption: '[رواه الترمذي]',
    content: "اللّهُمَّ إِنِّي أَمْسَيْتُ أُشْهِدُك، وَأُشْهِدُ حَمَلَةَ عَرْشِك، وَمَلائِكَتِك، وَجَميعَ خَلْقِك، أَنَّكَ أَنْتَ اللهُ لا إلهَ إلاّ أَنْتَ وَحْدَكَ لا شَريكَ لَك، وَأَنَّ مُحَمّداً عَبْدُكَ وَرَسولُك.",
    repeatDescription: '4 مرات',
    repeat: 4,
    audioFile: "masaa-02.mp3"
  },
  {
    category: CategoryEnum.Night,
    caption: '[رواه أبو داود]',
    content: "اللّهُمَّ ما أَمْسَى بي مِنْ نِعْمَةٍ أَو بِأَحَدٍ مِنْ خَلْقِك، فَمِنْكَ وَحْدَكَ لا شريكَ لَك، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْر.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "masaa-03.mp3"
  },
  {
    category: CategoryEnum.Night,
    caption: '[رواه ابن السني]',
    content: "حَسْبِيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَيهِ تَوَكَّلتُ وَهُوَ رَبُّ العَرْشِ العَظيم.",
    repeatDescription: '7 مرات',
    repeat: 7,
    audioFile: "sabah-05.mp3"
  },
  {
    category: CategoryEnum.Night,
    caption: '[رواه أبو داود والترمذي]',
    content: "بِسمِ اللهِ الذي لا يَضُرُّ مَعَ اسمِهِ شَيءٌ في الأرْضِ وَلا في السّماءِ وَهوَ السّميعُ العَليم.",
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "sabah-06.mp3"
  },
  {
    category: CategoryEnum.Night,
    caption: '[رواه الترمذي]',
    content: "اللّهُمَّ بِكَ أَمْسَينا وَبِكَ أَصْبَحْنا، وَبِكَ نَحْيا وَبِكَ نَمُوتُ وَإِلَيْكَ المَصِير.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "masaa-04.mp3"
  },
  {
    category: CategoryEnum.Night,
    caption: '[رواه الترمذي]',
    content: "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ.",
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "masaa-05.mp3"
  },
  {
    category: CategoryEnum.Night,
    caption: '[رواه أحمد]',
    content: "أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "masaa-06.mp3"
  },
  {
    category: CategoryEnum.Night,
    caption: '[رواه الترمذي]',
    content: "يا حَيُّ يا قَيّومُ بِرَحْمَتِكِ أَسْتَغيث، أَصْلِحْ لي شَأْني كُلَّه، وَلا تَكِلني إِلى نَفْسي طَرْفَةَ عَيْن.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "sabah-10.mp3"
  },
  {
    category: CategoryEnum.Night,
    caption: '[رواه أبو داود]',
    content: "اللّهُمَّ عافِني في بَدَني، اللّهُمَّ عافِني في سَمْعي، اللّهُمَّ عافِني في بَصَري، لا إلهَ إلاّ أَنْتَ.",
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "sabah-11.mp3"

  },
  {
    category: CategoryEnum.Night,
    caption: '[رواه النسائي]',
    content: " اللّهُمَّ إِنّي أَعوذُ بِكَ مِنَ الْكُفْر، وَالفَقْر، وَأَعوذُ بِكَ مِنْ عَذابِ القَبْر، لا إلهَ إلاّ أَنْتَ.",
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "sabah-12.mp3"

  },
  {
    category: CategoryEnum.Night,
    caption: '[رواه البخاري ومسلم]',
    content: "لا إلهَ إلاّ اللّهُ وحْدَهُ لا شَريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، وهُوَ على كُلّ شَيءٍ قَدير.",
    repeatDescription: '100 مرة',
    repeat: 100,
    audioFile: "masaa-07.mp3"
  },
  {
    category: CategoryEnum.Night,
    caption: '[رواه مسلم]',
    content: "سُبْحانَ اللهِ وَبِحَمْدِهِ.",
    repeatDescription: '100 مرة',
    repeat: 100,
    audioFile: "sabah-14.mp3"
  },
  {
    category: CategoryEnum.Night,
    caption: '[رواه البخاري ومسلم]',
    content: "أَسْتَغْفِرُ اللهَ وَأَتُوبُ إِلَيْهِ.",
    repeatDescription: '100 مرة',
    repeat: 100,
    audioFile: "sabah-15.mp3"
  },
  {
    category: CategoryEnum.Night,
    caption: '[رواه الطبراني]',
    content: "اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى نَبِيِّنَا مُحمَّد.",
    repeatDescription: '10 مرات',
    repeat: 10,
    audioFile: "sabah-16.mp3"
  },

  // ==========================================
  // أذكار النوم (Before Sleep)
  // ==========================================
  {
    category: CategoryEnum.BeforeSleep,
    caption: '[سورة البقرة: 255]',
    content: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "1.mp3"
  },
  {
    category: CategoryEnum.BeforeSleep,
    caption: '[سورة البقرة: 285-286]',
    content: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آمَنَ بِاللَّهِ وَمَلآئِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لاَ نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ وَقَالُواْ سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ* لاَ يُكَلِّفُ اللَّهُ نَفْساً إِلاَّ وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لاَ تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلاَ تَحْمِلْ عَلَيْنَا إِصْراً كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا وَلاَ تُحَمِّلْنَا مَا لاَ طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَآ أَنتَ مَوْلاَنَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "37.mp3"
  },
  {
    category: CategoryEnum.BeforeSleep,
    caption: '[عائشة أم المؤمنين]',
    content: 'كان رسولُ اللهِ إذا أوى إلى فراشه كلَّ ليلةٍ جمع كفَّيه فنفث فيهما ، وقرأ فيهما ( قُلْ هُوَ اللهُ أَحَدٌ ) و ( قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ) و ( قُلْ أَعُوذُ بِرَبِّ النَّاسِ ) ، ثم مسح بهما ما استطاع من جسدِه ، يبدأ بهما رأسَه ووجهَه ، وما أقبل من جسده ، يصنعُ ذلك ثلاثَ مراتٍ',
    audioFile: 'before-sleep-note.mp3',
  },
  {
    category: CategoryEnum.BeforeSleep,
    caption: '[قُلْ هُوَ اللهُ أَحَدٌ]',
    content: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلۡ هُوَ ٱللَّهُ أَحَدٌ ﴿١﴾ ٱللَّهُ ٱلصَّمَدُ ﴿٢﴾ لَمۡ يَلِدۡ وَلَمۡ يُولَدۡ ﴿٣﴾ وَلَمۡ يَكُن لَّهُۥ كُفُوًا أَحَدُۢ ﴿٤﴾",
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "2.mp3",
  },
  {
    category: CategoryEnum.BeforeSleep,
    caption: '[قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ]',
    content: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ ﴿١﴾ مِن شَرِّ مَا خَلَقَ ﴿٢﴾ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ﴿٣﴾ وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِي ٱلۡعُقَدِ ﴿٤﴾ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ ﴿٥﴾",
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "3.mp3",
  },
  {
    category: CategoryEnum.BeforeSleep,
    caption: '[قُلْ أَعُوذُ بِرَبِّ النَّاسِ]',
    content: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ ﴿١﴾ مَلِكِ ٱلنَّاسِ ﴿٢﴾ إِلَٰهِ ٱلنَّاسِ ﴿٣﴾ مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ ﴿٤﴾ ٱلَّذِي يُوَسۡوِسُ فِي صُدُورِ ٱلنَّاسِ ﴿٥﴾ مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ ﴿٦﴾",
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "4.mp3",
  },
  {
    category: CategoryEnum.BeforeSleep,
    caption: '[رواه البخاري ومسلم]',
    content: "بِاسْمِكَ رَبِّـي وَضَعْـتُ جَنْـبي، وَبِكَ أَرْفَعُـه، فَإِن أَمْسَـكْتَ نَفْسـي فارْحَـمْها ، وَإِنْ أَرْسَلْتَـها فاحْفَظْـها بِمـا تَحْفَـظُ بِه عِبـادَكَ الصّـالِحـين.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "before-sleep-01.mp3"
  },
  {
    category: CategoryEnum.BeforeSleep,
    caption: '[رواه البخاري ومسلم]',
    content: "اللَّهُمَّ إِنَّكَ خَلَقْتَ نَفْسِي وَأَنْتَ تَوَفَّاهَا، لَكَ مَمَاتُهَا وَمَحْيَاهَا، إِنْ أَحْيَيْتَهَا فَاحْفَظْهَا، وَإِنْ أَمَتَّهَا فَاغْفِرْ لَهَا، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "before-sleep-02.mp3"
  },
  {
    category: CategoryEnum.BeforeSleep,
    caption: '[رواه أبو داود]',
    content: "اللَّهُمَّ قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "before-sleep-03.mp3"
  },
  {
    category: CategoryEnum.BeforeSleep,
    caption: '[رواه البخاري ومسلم]',
    content: "بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَأَحْيَا.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "before-sleep-04.mp3"
  },
  {
    category: CategoryEnum.BeforeSleep,
    caption: '[رواه مسلم]',
    content: "الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا، وَكَفَانَا، وَآوَانَا، فَكَمْ مِمَّنْ لا كَافِيَ لَهُ وَلا مُؤْوِيَ.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "before-sleep-05.mp3"
  },
  {
    category: CategoryEnum.BeforeSleep,
    caption: '[رواه البخاري ومسلم]',
    content: "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ وَرَبَّ الأَرْضِ، وَرَبَّ الْعَرْشِ الْعَظِيمِ، رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ، فَالِقَ الْحَبِّ وَالنَّوَى، وَمُنْزِلَ التَّوْرَاةِ وَالْإِنْجِيلِ، وَالْفُرْقَانِ، أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ شَيْءٍ أَنْتَ آخِذٌ بِنَاصِيَتِهِ. اللَّهُمَّ أَنْتَ الأَوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ، وَأَنْتَ الآخِرُ فَلَيسَ بَعْدَكَ شَيْءٌ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ، اقْضِ عَنَّا الدَّيْنَ وَأَغْنِنَا مِنَ الْفَقْرِ.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "before-sleep-06.mp3"
  },
  {
    category: CategoryEnum.BeforeSleep,
    caption: '[رواه مسلم]',
    content: "اللَّهُمَّ عَالِمَ الغَيْبِ وَالشَّهَادَةِ، فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "before-sleep-07.mp3"
  },
  {
    category: CategoryEnum.BeforeSleep,
    caption: '[سورة السجدة وسورة الملك]',
    content: "قراءة سورة السجدة وسورة الملك.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioArray: [
      {
        fileName: 'sajda.mp3',
        title: 'سورة السجدة',
      },
      {
        fileName: 'almulk.mp3',
        title: 'سورة الملك',
      }
    ]
  },
  {
    category: CategoryEnum.BeforeSleep,
    caption: '[رواه البخاري ومسلم]',
    content: "سُبْحَانَ اللَّهِ (33)، وَالْحَمْدُ لِلَّهِ (33)، وَاللَّهُ أَكْبَرُ (34).",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "before-sleep-08.mp3"
  },
  {
    category: CategoryEnum.BeforeSleep,
    caption: '[رواه البخاري ومسلم]',
    content: "اللَّهُمَّ أَسْلَمْتُ نَفْسِي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ، وَوَجَّهْتُ وَجْهِي إِلَيْكَ، وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لَا مَلْجَأَ وَلَا مَنْجَا مِنْكَ إِلَّا إِلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ، وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "before-sleep-09.mp3"
  }
];

export const tasbihatData: DataProps[] = [
  {
    caption: 'يكتب له ألف حسنة أو يحط عنه ألف خطيئة.',
    content: 'سُبْحَانَ اللَّهِ',
    repeat: 1,
    audioFile: 'tasbihat-01.mp3',
  },
  {
    caption: 'حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ.',
    content: 'سُبْحَانَ اللَّهِ وَبِحَمْدِهِ',
    repeat: 1,
    audioFile: 'tasbihat-02.mp3',
  },
  {
    caption: 'تَمْلَآَنِ مَا بَيْنَ السَّمَاوَاتِ وَالْأَرْضِ.',
    content: 'سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ',
    repeat: 1,
    audioFile: 'tasbihat-03.mp3',
  },
  {
    caption: 'غرست له نخلة في الجنة (أى عدد).',
    content: 'سُبْحَانَ اللهِ العَظِيمِ وَبِحَمْدِهِ',
    repeat: 1,
    audioFile: 'tasbihat-04.mp3',
  },
  {
    caption: 'ثقيلتان في الميزان حبيبتان إلى الرحمن (أى عدد).',
    content: 'سُبْحَانَ اللَّهِ وَبِحَمْدِهِ ، سُبْحَانَ اللَّهِ الْعَظِيمِ',
    repeat: 1,
    audioFile: 'tasbihat-05.mp3',
  },
  {
    caption: 'كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان.',
    content: 'لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلُّ شَيْءِ قَدِيرِ.',
    repeat: 1,
    audioFile: 'tasbihat-06.mp3',
  },
  {
    caption: 'تملأ ميزان العبد بالحسنات.',
    content: 'الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ',
    repeat: 1,
    audioFile: 'tasbihat-07.mp3',
  },
  {
    caption: 'كنز من كنوز الجنة (أى عدد).',
    content: 'لا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ',
    repeat: 1,
    audioFile: 'tasbihat-08.mp3',
  },
  {
    caption: 'من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة.',
    content: 'الْلَّهُم صَلِّ وَسَلِم وَبَارِك عَلَى سَيِّدِنَا مُحَمَّد',
    repeat: 1,
    audioFile: 'tasbihat-09.mp3',
  },
  {
    caption: 'لفعل الرسول صلى الله عليه وسلم.',
    content: 'أستغفر الله',
    repeat: 1,
    audioFile: 'tasbihat-10.mp3',
  },
  {
    caption: 'أنهن أحب الكلام الى الله، ومكفرات للذنوب، وغرس الجنة، وجنة لقائلهن من النار، وأحب الى النبي عليه السلام مما طلعت عليه الشمس، والْبَاقِيَاتُ الْصَّالِحَات.',
    content: 'سُبْحَانَ الْلَّهِ، وَالْحَمْدُ لِلَّهِ، وَلَا إِلَهَ إِلَّا الْلَّهُ، وَالْلَّهُ أَكْبَرُ',
    repeat: 1,
    audioFile: 'tasbihat-11.mp3',
  },
  {
    caption: 'أفضل الذكر لا إله إلاّ الله.',
    content: 'لَا إِلَهَ إِلَّا اللَّهُ',
    repeat: 1,
    audioFile: 'tasbihat-12.mp3',
  },
  {
    caption: 'من قال الله أكبر كتبت له عشرون حسنة وحطت عنه عشرون سيئة. الله أكبر من كل شيء.',
    content: 'الْلَّهُ أَكْبَرُ',
    repeat: 1,
    audioFile: 'tasbihat-17.mp3',
  },
  {
    caption: 'خير الدنيا والآخرة',
    content: 'سُبْحَانَ اللَّهِ ، وَالْحَمْدُ لِلَّهِ ، وَلا إِلَهَ إِلا اللَّهُ ، وَاللَّهُ أَكْبَرُ ، اللَّهُمَّ اغْفِرْ لِي ، اللَّهُمَّ ارْحَمْنِي ، اللَّهُمَّ ارْزُقْنِي.',
    repeat: 1,
    audioFile: 'tasbihat-13.mp3',
  },
  {
    caption: 'قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقَدْ رَأَيْتُ اثْنَيْ عَشَرَ مَلَكًا يَبْتَدِرُونَهَا أَيُّهُمْ يَرْفَعُهَا',
    content: 'الْحَمْدُ لِلَّهِ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ.',
    repeat: 1,
    audioFile: 'tasbihat-14.mp3',
  },
  {
    caption: 'قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ "عَجِبْتُ لَهَا ، فُتِحَتْ لَهَا أَبْوَابُ السَّمَاءِ".',
    content: 'اللَّهُ أَكْبَرُ كَبِيرًا ، وَالْحَمْدُ لِلَّهِ كَثِيرًا ، وَسُبْحَانَ اللَّهِ بُكْرَةً وَأَصِيلاً.',
    repeat: 1,
    audioFile: 'tasbihat-15.mp3',
  },
  {
    caption: 'في كل مره تحط عنه عشر خطايا ويرفع له عشر درجات ويصلي الله عليه عشرا وتعرض على الرسول صلى الله عليه وسلم (أى عدد).',
    content: 'اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ , وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ , اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ.',
    repeat: 1,
    audioFile: 'tasbihat-16.mp3',
  }
]

export const duaaData: DataProps[] = [
  {
    caption: 'متفق عليه',
    content: "اللهم لك الحمد أنت نور السماوات والأرض ومن فيهن ولك الحمد، أنت قيوم السماوات والأرض ومن فيهن ولك الحمد، أنت الحق، ووعدك الحق، ولقاؤك حق، والجنة حق، والنار حق، والنبيون حق، والساعة حق، ومحمد حق، اللهم لك أسلمت، وبك آمنت، وعليك توكلت، وإليك أنبت، وبك خاصمت، وإليك حاكمت، فاغفر لى ما قدمت وما أخرت، وما أسررت وما أعلنت، أنت إلهى لا إله إلا أنت.",
    repeat: 1,
    audioFile: 'duaa-01.mp3',
  },
  {
    caption: 'البخاري برقم 3370 ومسلم، برقم 405',
    content: "اللهم صل على محمد، وعلى آل محمد، كما صليت على إبراهيم، وعلى آل إبراهيم، إنك حميد مجيد، وبارك على محمد، وعلى آل محمد، كما باركت على إبراهيم، وعلى آل إبراهيم، في العالمين إنك حميد مجيد",
    repeat: 1,
    audioFile: 'duaa-02.mp3',
  },
  {
    caption: 'صححه الألباني في صحيح الترمذي، 3/ 469',
    content: "أستغفر الله العظيم الذي لا إله إلا هو، الحي القيوم، وأتوب إليه",
    repeat: 1,
    audioFile: 'duaa-03.mp3',
  },
  {
    caption: 'أحمد في المسند، 3/ 249، برقم 1723',
    content: "اللهم اهدني فيمن هديت، وعافني فيمن عافيت، وتولني فيمن توليت، وبارك لي فيما أعطيت، وقني شر ما قضيت، إنه لا يذل من واليت، تباركت ربنا وتعاليت",
    repeat: 1,
    audioFile: 'duaa-04.mp3',
  },
  {
    caption: 'مسلم، برقم 2867',
    content: "اللهم إني أعوذ بك من عذاب النار، وأعوذ بك من عذاب القبر، وأعوذ بك من الفتن ما ظهر منها وما بطن، وأعوذ بك من فتنة الدجال",
    repeat: 1,
    audioFile: 'duaa-05.mp3',
  },
  {
    caption: 'البخاري، برقم 6363',
    content: "اللهم إني أعوذ بك من الهم والحزن، والعجز والكسل، والبخل والجبن، وضلع الدين، وغلبة الرجال",
    repeat: 1,
    audioFile: 'duaa-06.mp3',
  },
  {
    caption: 'صححه الألباني في صحيح موارد الظمآن',
    content: "اللهم إني أعوذ بك من علم لا ينفع، وعمل لا يرفع، وقلب لا يخشع، وقول لا يسمع",
    repeat: 1,
    audioFile: 'duaa-07.mp3',
  },
  {
    caption: 'وصححه الألباني في صحيح ابن ماجه، 3/ 259',
    content: "اللهم إني أسألك المعافاة في الدنيا والآخرة",
    repeat: 1,
    audioFile: 'duaa-08.mp3',
  },
  {
    caption: 'صححه الألباني في صحيح سنن أبي داود، 1/ 424.',
    content: "اللهم إني أعوذ بك من صلاة لا تنفع",
    repeat: 1,
    audioFile: 'duaa-09.mp3',
  },
  {
    caption: 'حسنه الألباني في سلسلة الأحاديث الصحيحة 4/ 113',
    content: "اللهم جدد الإيمان في قلبي",
    repeat: 1,
    audioFile: 'duaa-10.mp3',
  },
  {
    caption: 'مأخوذ من قول النبي صلى الله عليه وسلم البخاري، برقم 2790',
    content: "اللهم إني أسألك الفردوس أعلى الجنة",
    repeat: 1,
    audioFile: 'duaa-11.mp3',
  },
  {
    caption: 'وذكره الألباني سلسلة الأحاديث الصحيحة برقم 3228',
    content: "اللهم إني أسألك الثبات في الأمر، والعزيمة على الرشد، وأسألك موجبات رحمتك، وعزائم مغفرتك، وأسألك شكر نعمتك، وحسن عبادتك، وأسألك قلبا سليما، ولسانا صادقا، وأسألك من خير ما تعلم، وأعوذ بك من شر ما تعلم، وأستغفرك لما تعلم، إنك أنت علام الغيوب",
    repeat: 1,
    audioFile: 'duaa-12.mp3',
  },
  {
    caption: 'دلّ عليه حديث البخاري، برقم 6333',
    content: "اللهم ثبتني واجعلني هاديا مهديا",
    repeat: 1,
    audioFile: 'duaa-13.mp3',
  },
  {
    caption: 'صححه الألباني في إرواء الغليل، 1/115، برقم 74',
    content: "اللهم أحسنت خَلقي فأحسن خُلقي",
    repeat: 1,
    audioFile: 'duaa-14.mp3',
  },
  {
    caption: 'الترمذي، 5/ 326، برقم 3173',
    content: "اللهم زدنا ولا تنقصنا، وأكرمنا ولا تهنا، وأعطنا ولا تحرمنا، وآثرنا ولا تؤثر علينا، وأرضنا وارض عنا",
    repeat: 1,
    audioFile: 'duaa-15.mp3',
  },
  {
    caption: 'مسلم، برقم 2696',
    content: "اللهم اغفر لي، وارحمني، واهدني، وعافني، وارزقني",
    repeat: 1,
    audioFile: 'duaa-16.mp3',
  },
  {
    caption: 'أخرجه الحاكم، 1/ 541',
    content: "اللهم إني أسألك عيشة نقية، وميتة سوية، ومردا غير مخز ولا فاضح",
    repeat: 1,
    audioFile: 'duaa-17.mp3',
  },
  {
    caption: 'صححه الألباني في صحيح سنن النسائي، 1/356،',
    content: "اللهم اغفر لي، واهدني، وارزقني، وعافني، أعوذ بالله من ضيق المقام يوم القيامة",
    repeat: 1,
    audioFile: 'duaa-18.mp3',
  },
  {
    caption: 'صححه الألباني في صحيح النسائي، 3/1113.',
    content: "اللهم إني أعوذ بك من غلبة الدين، وغلبة العدو، وشماتة الأعداء",
    repeat: 1,
    audioFile: 'duaa-19.mp3',
  },
  {
    caption: 'صححه الألباني في تخريج رياض الصالحين',
    content: "اللهم قني شر نفسي، واعزم لي على أرشد أمري، اللهم اغفر لي ما أسررت، وما أعلنت، وما أخطأت، وما عمدت، وما علمت، وما جهلت",
    repeat: 1,
    audioFile: 'duaa-20.mp3',
  },
  {
    caption: 'من دعاء عبد الله بن مسعود رضي الله عنه',
    content: "اللهم إني أسألك إيمانا لا يرتد، ونعيما لا ينفد، ومرافقة محمد ﷺ في أعلى جنة الخلد",
    repeat: 1,
    audioFile: 'duaa-21.mp3',
  },
  {
    caption: 'صححه الالبانى فى صحيح الادب المفرد 534',
    content: "اللهم أعنا على ذكرك، وشكرك، وحسن عبادتك",
    repeat: 1,
    audioFile: 'duaa-22.mp3',
  },
  {
    caption: 'رواه أحمد، 6/48',
    content: "اللهم حاسبني حسابا يسيرا",
    repeat: 1,
    audioFile: 'duaa-23.mp3',
  },
  {
    caption: 'أخرجه الحاكم، 1/ 532، وصححه ووافقه الذهبي، 1/510',
    content: "اللهم قنعني بما رزقتني، وبارك لي فيه، واخلف علي كل غائبة لي بخير",
    repeat: 1,
    audioFile: 'duaa-24.mp3',
  },
  {
    caption: 'صححه الألباني في ظلال الجنة، برقم 13',
    content: "اللهم جنبني منكرات الأخلاق، والأهواء، والأعمال، والأدواء",
    repeat: 1,
    audioFile: 'duaa-25.mp3',
  },
  {
    caption: 'أخرجه الحاكم 1/ 520، وصححه ووافقه الذهبي، 1/520',
    content: "اللهم إني أسألك خير المسألة، وخير الدعاء، وخير النجاح، وخير العمل، وخير الثواب، وخير الحياة، وخير الممات، وثبتني،وثقل موازيني، وحقق إيماني، وارفع درجاتي، وتقبل صلاتي، واغفر خطيئتي، وأسألك الدرجات العلا من الجنة، اللهم إني أسألك فواتح الخير، وخواتمه، وجوامعه، وأوله، وظاهره، وباطنه،والدرجات العلا من الجنة آمين، اللهم إني أسألك خير ما آتي، وخير ما أفعل، وخير ما أعمل، وخير ما بطن، وخير ما ظهر، والدرجات العلا من الجنة آمين، اللهم إني أسألك أن ترفع ذكري، وتضع وزري، وتصلح أمري، وتطهر قلبي، وتحصن فرجي، وتنور قلبي، وتغفر لي ذنبي، وأسألك الدرجات العلا من الجنة آمين، اللهم إني أسألك أن تبارك في نفسي، وفي سمعي، وفي بصري، وفي روحي، وفي خلقي، وفي خلقي، وفي أهلي، وفي محياي، وفي مماتي، وفي عملي، فتقبل حسناتي، وأسألك الدرجات العلا من الجنة، آمين",
    repeat: 1,
    audioFile: 'duaa-26.mp3',
  },
  {
    caption: 'صححه الألباني في صحيح الأدب المفرد، برقم 630',
    content: "اللهم ألف بين قلوبنا، وأصلح ذات بيننا، واهدنا سبل السلام، ونجنا من الظلمات إلى النور، وجنبنا الفواحش ما ظهر منها وما بطن، وبارك لنا في أسماعنا، وأبصارنا، وقلوبنا، وأزواجنا، وذرياتنا، وتب علينا إنك أنت التواب الرحيم، واجعلنا شاكرين لنعمك مثنين بها عليك، قابلين لها، وأتممها علينا",
    repeat: 1,
    audioFile: 'duaa-27.mp3',
  },
  {
    caption: 'أخرجه مسلم، برقم 2713',
    content: "اللهم رب السموات ورب الأرض، ورب العرش العظيم، ربنا ورب كل شيء، فالق الحب والنوى، ومنزل التوراة والإنجيل والفرقان، أعوذ بك من شر كل شيء أنت آخذ بناصيته، اللهم أنت الأول فليس قبلك شيء، وأنت الآخر فليس بعدك شيء، وأنت الظاهر فليس فوقك شيء، وأنت الباطن فليس دونك شيء، اقض عنا الدين وأغننا من الفقر",
    repeat: 1,
    audioFile: 'duaa-28.mp3',
  },
  {
    caption: 'حسنه الألباني في صحيح سنن ابن ماجه، 2/327',
    content: "اللهم إني أسألك علما نافعا، وأعوذ بك من علم لا ينفع",
    repeat: 1,
    audioFile: 'duaa-29.mp3',
  },
  {
    caption: 'رواه الترمذي واللفظ له، 5/ 519، برقم 3483',
    content: "اللهم ألهمني رشدي، وأعذني من شر نفسي",
    repeat: 1,
    audioFile: 'duaa-30.mp3',
  },
  {
    caption: 'صححه الألباني في صحيح النسائي، 3/1121',
    content: "اللهم رب جبرائيل، وميكائيل، ورب إسرافيل، أعوذ بك من حر النار، ومن عذاب القبر",
    repeat: 1,
    audioFile: 'duaa-31.mp3',
  },
  {
    caption: 'النسائي، برقم 5469',
    content: "اللهم إني أعوذ بك من البخل، والجبن، وسوء العمر، وفتنة الصدر، وعذاب القبر",
    repeat: 1,
    audioFile: 'duaa-32.mp3',
  },
  {
    caption: 'أخرجه مسلم، برقم 476',
    content: "اللهم طهرني من الذنوب والخطايا، اللهم نقني منها كما ينقى الثوب الأبيض من الدنس، اللهم طهرني بالثلج والبرد والماء البارد",
    repeat: 1,
    audioFile: 'duaa-33.mp3',
  },
  {
    caption: 'أخرجه الترمذي، برقم 3491، وحسنه',
    content: "اللهم ارزقني حبك، وحب من ينفعني حبه عندك، اللهم ما رزقتني مما أحب فاجعله قوة لي فيما تحب، اللهم ما زويت عني مما أحب فاجعله فراغا لي فيما تحب",
    repeat: 1,
    audioFile: 'duaa-34.mp3',
  },
  {
    caption: 'صححه الألباني في تخريج فقه السيرة، ص 284',
    content: "اللهم لك الحمد كله، اللهم لا قابض لما بسطت، ولا باسط لما قبضت، ولا هادي لمن أضللت، ولا مضل لمن هديت، ولا معطي لما منعت، ولا مانع لما أعطيت، ولا مقرب لما باعدت، ولا مباعد لما قربت، اللهم ابسط علينا من بركاتك، ورحمتك، وفضلك، ورزقك، اللهم إني أسألك النعيم المقيم الذي لا يحول ولا يزول، اللهم إني أسألك النعيم يوم العيلة، والأمن يوم الخوف، اللهم إني عائذ بك من شر ما أعطيتنا وشر ما منعتنا، اللهم حبب إلينا الإيمان وزينه في قلوبنا، وكره إلينا الكفر والفسوق والعصيان، واجعلنا من الراشدين، اللهم توفنا مسلمين، وأحينا مسلمين، وألحقنا بالصالحين غير خزايا ولا مفتونين، اللهم قاتل الكفرة الذين يكذبون رسلك، ويصدون عن سبيلك، واجعل عليهم رجزك وعذابك، اللهم قاتل كفرة الذين أوتوا الكتاب، إله الحق آمين",
    repeat: 1,
    audioFile: 'duaa-35.mp3',
  },
  {
    caption: 'صححه الألباني في صحيح النسائي، 1/280، و1/ 281.',
    content: "اللهم بعلمك الغيب، وقدرتك على الخلق، أحيني ما علمت الحياة خيرا لي، وتوفني إذا علمت الوفاة خيرا لي، اللهم إني أسألك خشيتك في الغيب والشهادة، وأسألك كلمة الحق في الرضا والغضب، وأسألك القصد في الغنى والفقر، وأسألك نعيما لا ينفد، وأسألك قرة عين لا تنقطع، وأسألك الرضا بعد القضاء، وأسألك برد العيش بعد الموت، وأسألك لذة النظر إلى وجهك، والشوق إلى لقائك، في غير ضراء مضرة، ولا فتنة مضلة، اللهم زينا بزينة الإيمان، واجعلنا هداة مهتدين",
    repeat: 1,
    audioFile: 'duaa-36.mp3',
  },
  {
    caption: 'صححه الألباني في صحيح ابن ماجه، 2/321',
    content: "رب اغفر لي، وتب علي، إنك أنت التواب الغفور",
    repeat: 1,
    audioFile: 'duaa-37.mp3',
  },
  {
    caption: 'أخرجه الترمذي، برقم 3681',
    content: "اللهم متعني بسمعي، وبصري، واجعلهما الوارث مني، وانصرني على من يظلمني، وخذ منه بثأري",
    repeat: 1,
    audioFile: 'duaa-38.mp3',
  },
  {
    caption: 'صححه الألباني في صحيح سنن الترمذي، 3/163',
    content: "اللهم إني أسألك بأني أشهد أنك أنت الله لا إله إلا أنت، الأحد، الصمد، الذي لم يلد، ولم يولد، ولم يكن له كفوا أحد",
    repeat: 1,
    audioFile: 'duaa-39.mp3',
  },
  {
    caption: 'صححه الألباني في صحيح النسائي، 1/279',
    content: "اللهم إني أسألك بأن لك الحمد، لا إله إلا أنت وحدك لا شريك لك المنان يا بديع السموات والأرض، يا ذا الجلال والإكرام، يا حي يا قيوم، إني أسألك الجنة وأعوذ بك من النار",
    repeat: 1,
    audioFile: 'duaa-40.mp3',
  },
  {
    caption: 'صححه الألباني في صحيح سنن النسائي، 1/ 147.',
    content: "اللهم إني أسألك يا الله بأنك الواحد الأحد، الصمد، الذي لم يلد ولم يولد، ولم يكن له كفوا أحد، أن تغفر لي ذنوبي، إنك أنت الغفور الرحيم",
    repeat: 1,
    audioFile: 'duaa-41.mp3',
  },
  {
    caption: 'صححه الألباني في صحيح ابن ماجه، 1/152.',
    content: "اللهم إني أسألك علما نافعا، ورزقا طيبا، وعملا متقبلا",
    repeat: 1,
    audioFile: 'duaa-42.mp3',
  },
  {
    caption: 'صححه الألباني في صحيح ابن ماجه، 1/47.',
    content: "اللهم انفعني بما علمتني، وعلمني ما ينفعني، وزدني علما",
    repeat: 1,
    audioFile: 'duaa-43.mp3',
  },
  {
    caption: 'حسنه الألباني في صحيح الترغيب والترهيب، 1/19.',
    content: "اللهم إني أعوذ بك أن أشرك بك وأنا أعلم، وأستغفرك لما لا أعلم",
    repeat: 1,
    audioFile: 'duaa-44.mp3',
  },
  {
    caption: 'مأخوذ من دعاء النبي صلى الله عليه وسلم لابن عباس رضي اللَّه عنهما',
    content: "اللهم فقهني في الدين",
    repeat: 1,
    audioFile: 'duaa-45.mp3',
  },
  {
    caption: 'صححه الألباني في صحيح الترمذي، 2/319',
    content: "اللهم إني أسألك الجنة وأستجير بك من النار ثلاث مرات",
    repeat: 1,
    audioFile: 'duaa-46.mp3',
  },
  {
    caption: 'حسنه الألباني في صحيح الجامع، 1/411، برقم 1290.',
    content: "اللهم إني أعوذ بك من يوم السوء، ومن ليلة السوء، ومن ساعة السوء، ومن صاحب السوء، ومن جار السوء في دار المقامة",
    repeat: 1,
    audioFile: 'duaa-47.mp3',
  },
  {
    caption: 'صححه العلامة الألباني في صحيح الجامع، برقم 1295',
    content: "اللهم إني أعوذ بك من قلب لا يخشع، ومن دعاء لا يسمع، ومن نفس لا تشبع، ومن علم لا ينفع، أعوذ بك من هؤلاء الأربع",
    repeat: 1,
    audioFile: 'duaa-48.mp3',
  },
  {
    caption: 'قال الألباني في سلسلة الأحاديث الصحيحة، 7/ 377، برقم 3137',
    content: "اللهم إني أعوذ بك من جار السوء، ومن زوج تشيبني قبل المشيب، ومن ولد يكون علي ربا، ومن مال يكون علي عذابا، ومن خليل ماكر عينه تراني، وقلبه يرعاني؛ إن رأى حسنة دفنها، وإذا رأى سيئة أذاعها",
    repeat: 1,
    audioFile: 'duaa-49.mp3',
  },
  {
    caption: 'صححه الألباني في صحيح الجامع، 1/408',
    content: "اللهم إني أعوذ بك من جار السوء في دار المقامة؛ فإن جار البادية يتحول",
    repeat: 1,
    audioFile: 'duaa-50.mp3',
  },
  {
    caption: 'صححه الألباني، في صحيح موارد الظمآن، 2/ 455.',
    content: "اللهم إني أعوذ بك من الفقر، والفاقة، والقلة، والذلة، وأعوذ بك من أن أَظْلِمَ أو أُظْلَمَ",
    repeat: 1,
    audioFile: 'duaa-51.mp3',
  },
  {
    caption: 'صححه الألباني في صحيح الجامع، 1/406',
    content: "اللهم إني أعوذ بك من العجز، والكسل، والجبن، والبخل، والهرم، والقسوة، والغفلة، والعيلة، والذلة، والمسكنة، وأعوذ بك من الفقر، والكفر، والفسوق، والشقاق، والنفاق، والسمعة، والرياء، وأعوذ بك من الصمم، والبكم، والجنون، والجذام، والبرص، وسيىء الأسقام",
    repeat: 1,
    audioFile: 'duaa-52.mp3',
  },
  {
    caption: 'حسنه الألباني في صحيح النسائي، 3/1112.',
    content: "اللهم إني أعوذ بك من الجوع؛ فإنه بئس الضجيع، وأعوذ بك من الخيانة؛ فإنها بئست البطانة",
    repeat: 1,
    audioFile: 'duaa-53.mp3',
  },
  {
    caption: 'وصححه الألباني في صحيح النسائي، 3/1123',
    content: "اللهم إني أعوذ بك من الهرم، والتردي، والهدم، والغم، والغرق، والحرق، وأعوذ بك أن يتخبطني الشيطان عند الموت، وأعوذ بك أن أموت في سبيلك مدبرا، وأعوذ بك أن أموت لديغا",
    repeat: 1,
    audioFile: 'duaa-54.mp3',
  },
  {
    caption: 'صححه الألباني في صحيح الجامع، 1/404، برقم 1278.',
    content: "اللهم إني أسألك من فضلك ورحمتك؛ فإنه لا يملكها إلا أنت",
    repeat: 1,
    audioFile: 'duaa-55.mp3',
  },
  {
    caption: 'حسنه الألباني في صحيح الجامع، 1/ 399',
    content: "اللهم اغفر لي ذنبي، ووسع لي في داري، وبارك لي فيما رزقتني",
    repeat: 1,
    audioFile: 'duaa-56.mp3',
  },
  {
    caption: 'حسَّنه الألباني في صحيح الجامع، برقم 5902، 5/ 242.',
    content: "اللهم اغفر للمؤمنين والمؤمنات",
    repeat: 1,
    audioFile: 'duaa-57.mp3',
  },
  {
    caption: 'صححه الحاكم ووافقه الذهبى',
    content: "اللهم إنا نسألك موجبات رحمتك، وعزائم مغفرتك، والسلامة من كل إثم، والغنيمة من كل بر، والفوز بالجنة، والنجاة من النار",
    repeat: 1,
    audioFile: 'duaa-58.mp3',
  },
  {
    caption: 'متفق عليه',
    content: "اللهم لك أسلمت، وبك آمنت، وعليك توكلت، وإليك أنبت، وبك خاصمت. اللهم إني أعوذ بعزتك لا إله إلا أنت أن تضلني، أنت الحي الذي لا يموت، والجن والإنس يموتون",
    repeat: 1,
    audioFile: 'duaa-59.mp3',
  },
  {
    caption: 'متفق عليه',
    content: "اللهم إني ظلمت نفسي ظلما كثيرا، ولا يغفر الذنوب إلا أنت. فاغفر لي مغفرة من عندك، وارحمني إنك أنت الغفور الرحيم",
    repeat: 1,
    audioFile: 'duaa-60.mp3',
  },
  {
    caption: 'متفق عليه: البخاري، برقم 6398، ومسلم، برقم 2719',
    content: "اللهم اغفر لي خطيئتي، وجهلي، وإسرافي في أمري، وما أنت أعلم به مني، اللهم اغفر لي هزلي، وجدي، وخطئي، وعمدي، وكل ذلك عندي",
    repeat: 1,
    audioFile: 'duaa-61.mp3',
  },
  {
    caption: 'البخاري، برقم 2822',
    content: "اللهم إني أعوذ بك من الجبن، وأعوذ بك من البخل، وأعوذ بك من أن أرد إلى أرذل العمر، وأعوذ بك من فتنة الدنيا وعذاب القبر",
    repeat: 1,
    audioFile: 'duaa-62.mp3',
  },
  {
    caption: 'حسنه الألباني في صحيح الترمذي، 3/168',
    content: "اللهم اقسم لنا من خشيتك ما تحول به بيننا وبين معاصيك، ومن طاعتك ما تبلغنا به جنتك، ومن اليقين ما تهون به علينا مصائب الدنيا، اللهم متعنا بأسماعنا، وأبصارنا، وقواتنا ما أحييتنا، واجعله الوارث منا، واجعل ثأرنا على من ظلمنا، وانصرنا على من عادانا، ولا تجعل مصيبتنا في ديننا، ولا تجعل الدنيا أكبر همنا، ولا مبلغ علمنا، ولا تسلط علينا من لا يرحمنا",
    repeat: 1,
    audioFile: 'duaa-63.mp3',
  },
  {
    caption: 'حسنه الألباني في صحيح الجامع، 2/398',
    content: "اللهم احفظني بالإسلام قائما، واحفظني بالإسلام قاعدا، واحفظني بالإسلام راقدا، ولا تشمت بي عدوا ولا حاسدا. اللهم إني أسألك من كل خير خزائنه بيدك، وأعوذ بك من كل شر خزائنه بيدك",
    repeat: 1,
    audioFile: 'duaa-64.mp3',
  },
  {
    caption: 'صححه الألباني في صحيح ابن ماجه، 2/327.',
    content: "اللهم إني أسألك من الخير كله عاجله وآجله، ما علمت منه وما لم أعلم، وأعوذ بك من الشر كله عاجله وآجله، ما علمت منه وما لم أعلم. اللهم إني أسألك من خير ما سألك عبدك ونبيك، وأعوذ بك من شر ما استعاذ بك منه عبدك ونبيك. اللهم إني أسألك الجنة، وما قرب إليها من قول أو عمل، وأعوذ بك من النار وما قرب إليها من قول أو عمل، وأسألك أن تجعل كل قضاء قضيته لي خيرا",
    repeat: 1,
    audioFile: 'duaa-65.mp3',
  },
  {
    caption: 'صححه الألباني في صحيح الترمذي، 3/ 318',
    content: "اللهم إني أسألك فعل الخيرات، وترك المنكرات، وحب المساكين، وأن تغفر لي، وترحمني، وإذا أردت فتنة قوم فتوفني غير مفتون، وأسألك حبك، وحب من يحبك، وحب عمل يقربني إلى حبك",
    repeat: 1,
    audioFile: 'duaa-66.mp3',
  },
  {
    caption: 'صححه الألباني',
    content: "اللهم إنك عفو تحب العفو فاعف عني",
    repeat: 1,
    audioFile: 'duaa-67.mp3',
  },
  {
    caption: 'صححه الألباني في صحيح الترمذي، 3/184.',
    content: "اللهم إني أعوذ بك من منكرات الأخلاق، والأعمال، والأهواء",
    repeat: 1,
    audioFile: 'duaa-68.mp3',
  },
  {
    caption: 'وصححه الألباني في صحيح النسائي، 3/1116',
    content: "اللهم إني أعوذ بك من البرص، والجنون، والجذام، ومن سيئ الأسقام",
    repeat: 1,
    audioFile: 'duaa-69.mp3',
  },
  {
    caption: 'وصححه الألباني في صحيح الترمذي، 3/166',
    content: "اللهم إني أعوذ بك من شر سمعي، ومن شر بصري، ومن شر لساني، ومن شر قلبي، ومن شر منيي",
    repeat: 1,
    audioFile: 'duaa-70.mp3',
  },
  {
    caption: 'ضعفه الألباني في ضعيف الترمذي، ص 387',
    content: "اللهم إنا نسألك من خير ما سألك منه نبيك محمد صلى الله عليه وسلم، ونعوذ بك من شر ما استعاذ منه نبيك محمد صلى الله عليه وسلم، وأنت المستعان، وعليك البلاغ، ولا حول ولا قوة إلا بالله",
    repeat: 1,
    audioFile: 'duaa-71.mp3',
  },
  {
    caption: 'وصححه الألباني في صحيح أبي داود، 1/414',
    content: "رب أعني ولا تعن علي، وانصرني ولا تنصر علي، وامكر لي ولا تمكر علي، واهدني ويسر الهدى إلي، وانصرني على من بغى علي، رب اجعلني لك شكارا، لك ذكارا، لك رهابا، لك مطواعا، إليك مخبتا أواها منيبا، رب تقبل توبتي، واغسل حوبتي، وأجب دعوتي، وثبت حجتي، واهد قلبي، وسدد لساني، واسلل سخيمة قلبي",
    repeat: 1,
    audioFile: 'duaa-72.mp3',
  },
  {
    caption: 'أحمد، 4/181',
    content: "اللهم أحسن عاقبتنا في الأمور كلها، وأجرنا من خزي الدنيا وعذاب الآخرة",
    repeat: 1,
    audioFile: 'duaa-73.mp3',
  },
  {
    caption: 'صححه الألباني في صحيح ابن ماجه، 3/180، و3/185، و3/170',
    content: "اللهم إني أسألك اليقين والعفو والعافية في الدنيا والآخرة",
    repeat: 1,
    audioFile: 'duaa-74.mp3',
  },
  {
    caption: 'وصححه الألباني في صحيح الجامع، 6/309',
    content: "يا مقلب القلوب ثبت قلبي على دينك",
    repeat: 1,
    audioFile: 'duaa-75.mp3',
  },
  {
    caption: 'مسلم، برقم 2654',
    content: "اللهم مصرف القلوب صرف قلوبنا على طاعتك",
    repeat: 1,
    audioFile: 'duaa-76.mp3',
  },
  {
    caption: 'وصححه الألباني في تخريج الكلم الطيب، ص73',
    content: "اللهم إني عبدك ابن عبدك ابن أمتك، ناصيتي بيدك، ماض في حكمك، عدل في قضاؤك، أسألك بكل اسم هو لك سميت به نفسك، أو أنزلته في كتابك، أو علمته أحدا من خلقك، أو استأثرت به في علم الغيب عندك، أن تجعل القرآن ربيع قلبي، ونور صدري، وجلاء حزني، وذهاب همي",
    repeat: 1,
    audioFile: 'duaa-77.mp3',
  },
  {
    caption: 'وصححه الألباني في صحيح الترمذي، 3/168',
    content: "لا إله إلا أنت سبحانك إني كنت من الظالمين",
    repeat: 1,
    audioFile: 'duaa-78.mp3',
  },
  {
    caption: 'وحسنه الألباني في صحيح أبي داود، 3/ 250',
    content: "اللهم رحمتك أرجو فلا تكلني إلى نفسي طرفة عين، وأصلح لي شأني كله لا إله إلا أنت",
    repeat: 1,
    audioFile: 'duaa-79.mp3',
  },
  {
    caption: 'البخاري، برقم 6345، ومسلم، برقم 2730.',
    content: "لا إله إلا الله العظيم الحليم، لا إله إلا الله رب العرش العظيم، لا إله إلا الله رب السموات، ورب الأرض، ورب العرش الكريم",
    repeat: 1,
    audioFile: 'duaa-80.mp3',
  },
  {
    caption: 'البخاري، برقم 1982، ومسلم، برقم 660.',
    content: "اللهم أكثر مالي، وولدي، وبارك لي فيما أعطيتني",
    repeat: 1,
    audioFile: 'duaa-81.mp3',
  },
  {
    caption: 'مسلم، برقم 2716',
    content: "اللهم إني أعوذ بك من شر ما عملت، ومن شر ما لم أعمل",
    repeat: 1,
    audioFile: 'duaa-82.mp3',
  },
  {
    caption: 'أخرجه مسلم، برقم 2739.',
    content: "اللهم إني أعوذ بك من زوال نعمتك، وتحول عافيتك، وفجاءة نقمتك، وجميع سخطك",
    repeat: 1,
    audioFile: 'duaa-83.mp3',
  },
  {
    caption: 'أخرجه مسلم، برقم 2725.',
    content: "اللهم اهدني وسددني، اللهم إني أسألك الهدى والسداد",
    repeat: 1,
    audioFile: 'duaa-84.mp3',
  },
  {
    caption: 'أخرجه مسلم، برقم 2722.',
    content: "اللهم إني أعوذ بك من العجز، والكسل، والجبن، والبخل، والهرم، وعذاب القبر، اللهم آت نفسي تقواها، وزكها أنت خير من زكاها، أنت وليها ومولاها، اللهم إني أعوذ بك من علم لا ينفع، ومن قلب لا يخشع، ومن نفس لا تشبع، ومن دعوة لا يستجاب لها",
    repeat: 1,
    audioFile: 'duaa-85.mp3',
  },
  {
    caption: 'أخرجه مسلم، برقم 2721.',
    content: "اللهم إني أسألك الهدى، والتقى، والعفاف، والغنى",
    repeat: 1,
    audioFile: 'duaa-86.mp3',
  },
  {
    caption: 'أخرجه مسلم، برقم 2720',
    content: "اللهم أصلح لي ديني الذي هو عصمة أمري، وأصلح لي دنياي التي فيها معاشي، وأصلح لي آخرتي التي فيها معادي، واجعل الحياة زيادة لي في كل خير، واجعل الموت راحة لي من كل شر",
    repeat: 1,
    audioFile: 'duaa-87.mp3',
  },
  {
    caption: 'البخاري، برقم 6347، ومسلم، برقم 2707',
    content: "اللهم إني أعوذ بك من جهد البلاء، ودرك الشقاء، وسوء القضاء، وشماتة الأعداء",
    repeat: 1,
    audioFile: 'duaa-88.mp3',
  },
  {
    caption: 'البخاري، برقم 2823، ومسلم، برقم 2706.',
    content: "اللهم إني أعوذ بك من العجز، والكسل، والجبن، والهرم، والبخل، وأعوذ بك من عذاب القبر، ومن فتنة المحيا والممات",
    repeat: 1,
    audioFile: 'duaa-89.mp3',
  },
  {
    caption: 'البخاري، برقم 832، ومسلم، برقم 589',
    content: "اللهُمَّ إنِّي أعوذُ بك مِنَ الكَسَلِ والهَرَمِ، والمَأثَمِ والمَغرَمِ، ومِن فِتنةِ القَبرِ وعَذابِ القَبرِ، ومِن فِتنةِ النَّارِ وعَذابِ النَّارِ، ومِن شَرِّ فِتنةِ الغِنى، وأعوذُ بك مِن فِتنةِ الفَقرِ، وأعوذُ بك مِن فِتنةِ المَسيحِ الدَّجَّالِ، اللهُمَّ اغسِلْ عَنِّي خَطايايَ بماءِ الثَّلجِ والبَرَدِ، ونَقِّ قَلبي مِنَ الخَطايا كما نَقَّيتَ الثَّوبَ الأبيَضَ مِنَ الدَّنَسِ، وباعِدْ بَيني وبينَ خَطايايَ كما باعَدتَ بينَ المَشرِقِ والمَغرِبِ",
    repeat: 1,
    audioFile: 'duaa-90.mp3',
  },
  {
    caption: 'البخاري، برقم 4522، ورقم 6389، ومسلم، برقم 2690.',
    content: "اللهم آتنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار",
    repeat: 1,
    audioFile: 'duaa-91.mp3',
  },
  {
    caption: 'مقتبس من سورة التغابن، الآية: 16.',
    content: "اللهم قني شح نفسي واجعلني من المفلحين",
    repeat: 1,
    audioFile: 'duaa-92.mp3',
  },
  {
    caption: 'مقتبس من سورة الحجرات، الآية: 7',
    content: "اللهم حبب إلينا الإيمان وزينه في قلوبنا، وكره إلينا الكفر والفسوق والعصيان، واجعلنا من الراشدين",
    repeat: 1,
    audioFile: 'duaa-93.mp3',
  },
  {
    caption: 'مقتبس من سورة إبراهيم، الآية: 27.',
    content: "اللهم ثبتني بالقول الثابت في الحياة الدنيا وفي الآخرة",
    repeat: 1,
    audioFile: 'duaa-94.mp3',
  },
  {
    caption: 'مقتبس من سورة البقرة، الآية:269',
    content: "اللهم آتني الحكمة التي من أوتيها فقد أوتي خيرا كثيرا",
    repeat: 1,
    audioFile: 'duaa-95.mp3',
  },
  {
    caption: 'مقتبس من سورة البقرة، الآية: 213.',
    content: "اللهم اهدني لما اختلف فيه من الحق بإذنك، إنك تهدي من تشاء إلى صراط مستقيم",
    repeat: 1,
    audioFile: 'duaa-96.mp3',
  }
]
