type Category = CategoryEnum.Morning | CategoryEnum.Night | 'BeforeSleep';
type AudioFile = {
  fileName: string;
  title: string;
}
export type DataProps = {
  caption?: string;
  content?: string;
  repeatDescription? : string;
  repeat?: number;
  audioFile?: string;
  category?: Category;
  note?: string;
  audioArray?: AudioFile[];
  isStacked?: boolean;
}

enum CategoryEnum {
  Morning = 'Morning',
  Night = 'Night',
  BeforeSleep = 'BeforeSleep',
}

export const data: DataProps[] = [
  {
    caption: '[حديث]',
    content: 'بسم الله توكلت على الله ولا حول ولا قوة إلا بالله',
    repeatDescription: '3 مرات',
    repeat: 3,
  },
  {
    caption: '[حديث]',
    content: 'اللهم صل على محمد وعلى آل محمد كما صليت على إبراهيم وعلى آل إبراهيم وبارك على محمد وعلى آل محمد كما باركت على إبراهيم وعلى آل ابراهيم في العالمين إنك حميد مجيد',
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[حديث]',
    content: 'حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم',
    repeatDescription: '7 مرات',
    repeat: 7,
  },
  {
    caption: '[حديث]',
    content: 'بسم الله الذي لا يضر مع اسمه شيء في الارض ولا في السماء وهو السميع العليم',
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "10.mp3"
  },
  {
    caption: '[حديث]',
    content: 'اللهم رب الناس أذهب الباس إشفِ أنت الشافي لا شفاء إلا شفاءك شفاءً لا يغادر سقما',
    repeatDescription: '3 مرات',
    repeat: 3,
  },
  {
    caption: '[حديث]',
    content: 'بسم الله ارقيك، من كل شيء يؤذيك، من شر كل نفس أو عين حاسد، الله يشفيك، بسم الله ارقيك',
    repeatDescription: '3 مرات',
    repeat: 3,
  },
  {
    caption: '[الأذان]',
    content: `الله أكبر، الله أكبر،
    الله أكبر، الله أكبر،
    أشهد أن لا إله إلا الله،
    أشهد أن لا إله إلا الله، 
    أشهد أن محمدًا رسولُ الله،
    أشهد أن محمدًا رسولُ الله،
    حيَّ على الصلاة، حيَّ على الصلاة،
    حيَّ على الفلاح، حيَّ على الفلاح،
    الله أكبر، الله أكبر،
    لا إله إلا الله`,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "adan.mp3",
  },
  {
    caption: '[سورة الفاتحة، آية: 1-7]',
    content: `
    {بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ* الْحَمْدُ لِلَّـهِ رَبِّ الْعَالَمِينَ* الرَّحْمَـٰنِ الرَّحِيمِ* مَالِكِ يَوْمِ الدِّينِ* إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ* اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ* صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ}.
    `,
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "fatiha.mp3",
  },
  {
    caption: '[سورة البقرة، آية: 1-5]',
    content: `
    {الم* ذَٰلِكَ الْكِتَابُ لَا رَيْبَ ۛ فِيهِ ۛ هُدًى لِّلْمُتَّقِينَ* الَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ وَيُقِيمُونَ الصَّلَاةَ وَمِمَّا رَزَقْنَاهُمْ يُنفِقُونَ* وَالَّذِينَ يُؤْمِنُونَ بِمَا أُنزِلَ إِلَيْكَ وَمَا أُنزِلَ مِن قَبْلِكَ وَبِالْآخِرَةِ هُمْ يُوقِنُونَ* أُولَـٰئِكَ عَلَىٰ هُدًى مِّن رَّبِّهِمْ ۖ وَأُولَـٰئِكَ هُمُ الْمُفْلِحُونَ}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة البقرة، آية: 255]',
    content: `
    {اللَّـهُ لَا إِلَـٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ}.
    `,
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "1.mp3"
  },
  {
    caption: '[سورة البقرة، آية: 102]',
    content: `
    {وَاتَّبَعُوا مَا تَتْلُو الشَّيَاطِينُ عَلَىٰ مُلْكِ سُلَيْمَانَ وَمَا كَفَرَ سُلَيْمَانُ وَلَـٰكِنَّ الشَّيَاطِينَ كَفَرُوا يُعَلِّمُونَ النَّاسَ السِّحْرَ وَمَا أُنزِلَ عَلَى الْمَلَكَيْنِ بِبَابِلَ هَارُوتَ وَمَارُوتَ وَمَا يُعَلِّمَانِ مِنْ أَحَدٍ حَتَّى يَقُولَا إِنَّمَا نَحْنُ فِتْنَةٌ فَلَا تَكْفُرْ فَيَتَعَلَّمُونَ مِنْهُمَا مَا يُفَرِّقُونَ بِهِ بَيْنَ الْمَرْءِ وَزَوْجِهِ وَمَا هُم بِضَارِّينَ بِهِ مِنْ أَحَدٍ إِلَّا بِإِذْنِ اللَّـهِ وَيَتَعَلَّمُونَ مَا يَضُرُّهُمْ وَلَا يَنفَعُهُمْ وَلَقَدْ عَلِمُوا لَمَنِ اشْتَرَاهُ مَا لَهُ فِي الْآخِرَةِ مِنْ خَلَاقٍ وَلَبِئْسَ مَا شَرَوْا بِهِ أَنفُسَهُمْ لَوْ كَانُوا يَعْلَمُونَ}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة البقرة، آية: 285-286]',
    content: `
    {آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ وَقَالُوا سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ ۝ لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "37.mp3",
  },
  {
    caption: '[سورة آل عمران، آية: 1-5]',
    content: `
    {الم* اللَّـهُ لَا إِلَـٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ* نَزَّلَ عَلَيْكَ الْكِتَابَ بِالْحَقِّ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ وَأَنزَلَ التَّوْرَاةَ وَالْإِنجِيلَ*مِن قَبْلُ هُدًى لِّلنَّاسِ وَأَنزَلَ الْفُرْقَانَ إِنَّ الَّذِينَ كَفَرُوا بِآيَاتِ اللَّـهِ لَهُمْ عَذَابٌ شَدِيدٌ وَاللَّـهُ عَزِيزٌ ذُو انتِقَامٍ* إِنَّ اللَّـهَ لَا يَخْفَىٰ عَلَيْهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة آل عمران، آية: 26-27]',
    content: `
    {قُلِ اللَّـهُمَّ مَالِكَ الْمُلْكِ تُؤْتِي الْمُلْكَ مَن تَشَاءُ وَتَنزِعُ الْمُلْكَ مِمَّن تَشَاءُ وَتُعِزُّ مَن تَشَاءُ وَتُذِلُّ مَن تَشَاءُ بِيَدِكَ الْخَيْرُ إِنَّكَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ* تُولِجُ اللَّيْلَ فِي النَّهَارِ وَتُولِجُ النَّهَارَ فِي اللَّيْلِ وَتُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ وَتُخْرِجُ الْمَيِّتَ مِنَ الْحَيِّ وَتَرْزُقُ مَن تَشَاءُ بِغَيْرِ حِسَابٍ}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة الأعراف، آية: 117-122]',
    content: `
    {وَأَوحَينا إِلى موسى أَن أَلقِ عَصاكَ فَإِذا هِيَ تَلقَفُ ما يَأفِكونَ* فَوَقَعَ الحَقُّ وَبَطَلَ ما كانوا يَعمَلونَ*فَغُلِبوا هُنالِكَ وَانقَلَبوا صاغِرينَ* وَأُلقِيَ السَّحَرَةُ ساجِدينَ*قالوا آمَنّا بِرَبِّ العالَمينَ* رَبِّ موسى وَهارونَ}.
    `,
    repeatDescription: '3 مرات',
    repeat: 3,
  },
  {
    caption: '[طه 69]',
    content: `
    {وَأَلْقِ مَا فِي يَمِينِكَ تَلْقَفْ مَا صَنَعُوا إِنَّمَا صَنَعُوا كَيْدُ سَاحِرٍ وَلَا يُفْلِحُ السَّاحِرُ حَيْثُ أَتَى}
    `,
    repeatDescription: '3 مرات',
    repeat: 3,
  },
  {
    caption: '[سورة يونس، آية: 79-82]',
    content: `
    {وَقالَ فِرعَونُ ائتوني بِكُلِّ ساحِرٍ عَليمٍ* فَلَمّا جاءَ السَّحَرَةُ قالَ لَهُم موسى أَلقوا ما أَنتُم مُلقونَ* فَلَمّا أَلقَوا قالَ موسى ما جِئتُم بِهِ السِّحرُ إِنَّ اللَّـهَ سَيُبطِلُهُ إِنَّ اللَّـهَ لا يُصلِحُ عَمَلَ المُفسِدينَ* وَيُحِقُّ اللَّـهُ الحَقَّ بِكَلِماتِهِ وَلَو كَرِهَ المُجرِمونَ}.
    `,
    repeatDescription: '3 مرات',
    repeat: 3,
  },
  {
    caption: '[سورة المؤمنون، آية: 97-98]',
    content: `
    {وَقُل رَّبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ* وَأَعُوذُ بِكَ رَبِّ أَن يَحْضُرُونِ}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[الأنبياء 8]',
    content: `
    {وَذَا النُّونِ إِذ ذَّهَبَ مُغَاضِبًا فَظَنَّ أَن لَّن نَّقْدِرَ عَلَيْهِ فَنَادَى فِي الظُّلُمَاتِ أَن لَّا إِلَهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ . فَاسْتَجَبْنَا لَهُ وَنَجَّيْنَاهُ مِنَ الْغَمِّ وَكَذَلِكَ نُنجِي الْمُؤْمِنِينَ}
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[الأنبياء 83]',
    content: `
    {وَأَيُّوبَ إِذْ نَادَى رَبَّهُ أَنِّي مَسَّنِيَ الضُّرُّ وَأَنتَ أَرْحَمُ الرَّاحِمِين فَاسْتَجَبْنَا لَهُ فَكَشَفْنَا مَا بِهِ مِن ضُرٍّ وَآتَيْنَاهُ أَهْلَهُ وَمِثْلَهُم مَّعَهُمْ رَحْمَةً مِّنْ عِندِنَا وَذِكْرَى لِلْعَابِدِينَ}
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[مريم – 68 ، 72]',
    content: `
    {فَوَرَبِّكَ لَنَحْشُرَنَّهُمْ وَالشَّيَاطِينَ ثُمَّ لَنُحْضِرَنَّهُمْ حَوْلَ جَهَنَّمَ جِثِيًّا * ثُمَّ لَنَنزِعَنَّ مِنْ كُلِّ شِيعَـــةٍ أَيُّهُـــمْ أَشَــدُّ عَلَى الرَّحْمَنِ عِتِيـًّا * ثُـمَّ لَنَحـْنُ أَعْلَـمُ بِالَّذِينَ هُـمْ أَوْلَى بِهَا صِلِيـًّا * وَإِنْ مِنْكُـمْ إِلا وَارِدُهَا كَانَ عَلَى رَبِّكَ حَتْمًا مَقْضِيًّا * ثُمَّ نُنَجِّى الَّذِينَ اتَّقَوْا وَنَذَرُ الظَّالِمِينَ فِيهَا جِثِيًّا}
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[إبراهيم – 15 ، 17]',
    content: `
    {وَاسْتَفْتَحُوا وَخَابَ كُلُّ جَبَّارٍ عَنِيدٍ * مِنْ وَرَائِهِ جَهَنَّمُ وَيُسْقَى مِنْ مَاءٍ صَدِيدٍ * يَتَجَرَّعُهُ وَلا يَكَادُ يُسِيغُهُ وَيَأْتِيهِ الْمَوْتُ مِنْ كُلِّ مَكَانٍ وَمَا هُوَ بِمَيِّتٍ وَمِنْ وَرَائِهِ عَذَابٌ غَلِيظٌ}
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[غافر : 44]',
    content: `
    {وَأُفَوِّضُ أَمْرِي إِلَى اللَّهِ إِنَّ اللَّهَ بَصِيرٌ بِالْعِبَادِ . فَوَقَاهُ اللَّهُ سَيِّئَاتِ مَا مَكَرُوا وَحَاقَ بِآلِ فِرْعَوْنَ سُوءُ الْعَذَابِ}
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة الإسراء، آية: 80-82]',
    content: `
    {وَقُل رَبِّ أَدخِلني مُدخَلَ صِدقٍ وَأَخرِجني مُخرَجَ صِدقٍ وَاجعَل لي مِن لَدُنكَ سُلطانًا نَصيرًا* وَقُل جاءَ الحَقُّ وَزَهَقَ الباطِلُ إِنَّ الباطِلَ كانَ زَهوقًا* وَنُنَزِّلُ مِنَ القُرآنِ ما هُوَ شِفاءٌ وَرَحمَةٌ لِلمُؤمِنينَ وَلا يَزيدُ الظّالِمينَ إِلّا خَسارًا}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة النور، آية، 35]',
    content: `
    {اللَّـهُ نُورُ السَّمَاوَاتِ وَالْأَرْضِ مَثَلُ نُورِهِ كَمِشْكَاةٍ فِيهَا مِصْبَاحٌ الْمِصْبَاحُ فِي زُجَاجَةٍ الزُّجَاجَةُ كَأَنَّهَا كَوْكَبٌ دُرِّيٌّ يُوقَدُ مِن شَجَرَةٍ مُّبَارَكَةٍ زَيْتُونَةٍ لَّا شَرْقِيَّةٍ وَلَا غَرْبِيَّةٍ يَكَادُ زَيْتُهَا يُضِيءُ وَلَوْ لَمْ تَمْسَسْهُ نَارٌ نُّورٌ عَلَى نُورٍ يَهْدِي اللَّـهُ لِنُورِهِ مَن يَشَاءُ وَيَضْرِبُ اللَّـهُ الْأَمْثَالَ لِلنَّاسِ وَاللَّـهُ بِكُلِّ شَيْءٍ عَلِيمٌ}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة يس، آية: 1-9]',
    content: `
    {يس* وَالْقُرْآنِ الْحَكِيمِ* إِنَّكَ لَمِنَ الْمُرْسَلِينَ* عَلَى صِرَاطٍ مُّسْتَقِيمٍ* تَنزِيلَ الْعَزِيزِ الرَّحِيمِ* لِتُنذِرَ قَوْمًا مَّا أُنذِرَ آبَاؤُهُمْ فَهُمْ غَافِلُونَ* لَقَدْ حَقَّ الْقَوْلُ عَلَى أَكْثَرِهِمْ فَهُمْ لَا يُؤْمِنُونَ* إِنَّا جَعَلْنَا فِي أَعْنَاقِهِمْ أَغْلاَلاً فَهِيَ إِلَى الأَذْقَانِ فَهُم مُّقْمَحُونَ* وَجَعَلْنَا مِن بَيْنِ أَيْدِيهِمْ سَدًّا وَمِنْ خَلْفِهِمْ سَدًّا فَأَغْشَيْنَاهُمْ فَهُمْ لاَ يُبْصِرُونَ}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة الصافات، آية: 1-18]',
    content: `
    {وَالصَّافَّاتِ صَفًّا* فَالزَّاجِرَاتِ زَجْرًا* فَالتَّالِيَاتِ ذِكْرًا* إِنَّ إِلَٰهَكُمْ لَوَاحِدٌ* رَّبُّ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا وَرَبُّ الْمَشَارِقِ* إِنَّا زَيَّنَّا السَّمَاءَ الدُّنْيَا بِزِينَةٍ الْكَوَاكِبِ* وَحِفْظًا مِّن كُلِّ شَيْطَانٍ مَّارِدٍ* لَّا يَسَّمَّعُونَ إِلَى الْمَلَإِ الْأَعْلَى وَيُقْذَفُونَ مِن كُلِّ جَانِبٍ* دُحُورًا ۖ وَلَهُمْ عَذَابٌ وَاصِبٌ* إِلَّا مَنْ خَطِفَ الْخَطْفَةَ فَأَتْبَعَهُ شِهَابٌ ثَاقِبٌ* فَاسْتَفْتِهِمْ أَهُمْ أَشَدُّ خَلْقًا أَم مَّنْ خَلَقْنَا ۚ إِنَّا خَلَقْنَاهُم مِّن طِينٍ لَّازِبٍ* بَلْ عَجِبْتَ وَيَسْخَرُونَ* وَإِذَا ذُكِّرُوا لَا يَذْكُرُونَ* وَإِذَا رَأَوْا آيَةً يَسْتَسْخِرُونَ* وَقَالُوا إِنْ هَٰذَا إِلَّا سِحْرٌ مُّبِينٌ* أَإِذَا مِتْنَا وَكُنَّا تُرَابًا وَعِظَامًا أَإِنَّا لَمَبْعُوثُونَ* أَوَآبَاؤُنَا الْأَوَّلُونَ* قُلْ نَعَمْ وَأَنتُمْ دَاخِرُونَ}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة الصافات، آية: 177-182]',
    content: `
    {فَإِذَا نَزَلَ بِسَاحَتِهِمْ فَسَاء صَبَاحُ الْمُنذَرِينَ * وَتَوَلَّ عَنْهُمْ حَتَّى حِينٍ * وَأَبْصِرْ فَسَوْفَ يُبْصِرُونَ * سُبْحَانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ * وَسَلامٌ عَلَى الْمُرْسَلِينَ * وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ *}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة الجن، آية: 1-9]',
    content: `
    {قُلْ أُوحِيَ إِلَيَّ أَنَّهُ اسْتَمَعَ نَفَرٌ مِّنَ الْجِنِّ فَقَالُوا إِنَّا سَمِعْنَا قُرْآنًا عَجَبًا* يَهْدِي إِلَى الرُّشْدِ فَآمَنَّا بِهِ ۖ وَلَن نُّشْرِكَ بِرَبِّنَا أَحَدًا* وَأَنَّهُ تَعَالَىٰ جَدُّ رَبِّنَا مَا اتَّخَذَ صَاحِبَةً وَلَا وَلَدًا* وَأَنَّهُ كَانَ يَقُولُ سَفِيهُنَا عَلَى اللهِ شَطَطًا* وَأَنَّا ظَنَنَّا أَن لَّن تَقُولَ الْإِنسُ وَالْجِنُّ عَلَى اللهِ كَذِبًا* وَأَنَّهُ كَانَ رِجَالٌ مِّنَ الْإِنسِ يَعُوذُونَ بِرِجَالٍ مِّنَ الْجِنِّ فَزَادُوهُمْ رَهَقًا* وَأَنَّهُمْ ظَنُّوا كَمَا ظَنَنتُمْ أَن لَّن يَبْعَثَ اللهُ أَحَدًا* وَأَنَّا لَمَسْنَا السَّمَاءَ فَوَجَدْنَاهَا مُلِئَتْ حَرَسًا شَدِيدًا وَشُهُبًا* وَأَنَّا كُنَّا نَقْعُدُ مِنْهَا مَقَاعِدَ لِلسَّمْعِ ۖ فَمَن يَسْتَمِعِ الْآنَ يَجِدْ لَهُ شِهَابًا رَّصَدًا}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة الطارق، آية 1-17]',
    content: `
    {وَٱلسَّمَآءِ وَٱلطَّارِقِ  * وَمَآ أَدۡرَىٰكَ مَا ٱلطَّارِقُ *  ٱلنَّجۡمُ ٱلثَّاقِبُ * إِن كُلُّ نَفۡسٖ لَّمَّا عَلَيۡهَا حَافِظٞ * فَلۡيَنظُرِ ٱلۡإِنسَٰنُ مِمَّ خُلِقَ * خُلِقَ مِن مَّآءٖ دَافِقٖ * يَخۡرُجُ مِنۢ بَيۡنِ ٱلصُّلۡبِ وَٱلتَّرَآئِبِ * إِنَّهُۥ عَلَىٰ رَجۡعِهِۦ لَقَادِرٞ * يَوۡمَ تُبۡلَى ٱلسَّرَآئِرُ * فَمَا لَهُۥ مِن قُوَّةٖ وَلَا نَاصِرٖ * وَٱلسَّمَآءِ ذَاتِ ٱلرَّجۡعِ * وَٱلۡأَرۡضِ ذَاتِ ٱلصَّدۡعِ * إِنَّهُۥ لَقَوۡلٞ فَصۡلٞ * وَمَا هُوَ بِٱلۡهَزۡلِ * إِنَّهُمۡ يَكِيدُونَ كَيۡدٗا * وَأَكِيدُ كَيۡدٗا * فَمَهِّلِ ٱلۡكَٰفِرِينَ أَمۡهِلۡهُمۡ رُوَيۡدَۢا *}
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة الحشر آية: 21-24]',
    content: `
    {لَوۡ أَنزَلۡنَا هَٰذَا ٱلۡقُرۡءَانَ عَلَىٰ جَبَلٖ لَّرَأَيۡتَهُۥ خَٰشِعٗا مُّتَصَدِّعٗا مِّنۡ خَشۡيَةِ ٱللَّهِۚ وَتِلۡكَ ٱلۡأَمۡثَٰلُ نَضۡرِبُهَا لِلنَّاسِ لَعَلَّهُمۡ يَتَفَكَّرُونَ * هُوَ ٱللَّهُ ٱلَّذِي لَآ إِلَٰهَ إِلَّا هُوَۖ عَٰلِمُ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِۖ هُوَ ٱلرَّحۡمَٰنُ ٱلرَّحِيمُ * هُوَ ٱللَّهُ ٱلَّذِي لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡمَلِكُ ٱلۡقُدُّوسُ ٱلسَّلَٰمُ ٱلۡمُؤۡمِنُ ٱلۡمُهَيۡمِنُ ٱلۡعَزِيزُ ٱلۡجَبَّارُ ٱلۡمُتَكَبِّرُۚ سُبۡحَٰنَ ٱللَّهِ عَمَّا يُشۡرِكُونَ * هُوَ ٱللَّهُ ٱلۡخَٰلِقُ ٱلۡبَارِئُ ٱلۡمُصَوِّرُۖ لَهُ ٱلۡأَسۡمَآءُ ٱلۡحُسۡنَىٰۚ يُسَبِّحُ لَهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ *}
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة الشرح، آية: 1-8]',
    content: `
    {أَلَمْ نَشْرَحْ لَكَ صَدْرَكَ* وَوَضَعْنَا عَنكَ وِزْرَكَ* الَّذِي أَنقَضَ ظَهْرَكَ* وَرَفَعْنَا لَكَ ذِكْرَكَ* فَإِنَّ مَعَ الْعُسْرِ يُسْرًا* إِنَّ مَعَ الْعُسْرِ يُسْرًا* فَإِذَا فَرَغْتَ فَانصَبْ* وَإِلَى رَبِّكَ فَارْغَب}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة النساء، آية:56]',
    content: `
    { إِنَّ الَّذِينَ كَفَرُوا بِآيَاتِنَا سَوْفَ نُصْلِيهِمْ نَاراً كُلَّمَا نَضِجَتْ جُلُودُهُمْ بَدَّلْنَاهُمْ جُلُوداً غَيْرَهَا لِيَذُوقُوا الْعَذَابَ, إِنَّ اللَّهَ كَانَ عَزِيزاً حَكِيماً}
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة الأنفال، آية:50]',
    content: `
    {وَلَوْ تَرَى إِذْ يَتَوَفَّى الَّذِينَ كَفَرُواْ الْمَلآئِكَةُ يَضْرِبُونَ وُجُوهَهُمْ وَأَدْبَارَهُمْ وَذُوقُواْ عَذَابَ الْحَرِيـقِ}
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة الكافرون، آية: 1-6]',
    content: `
    {قُلۡ يَٰٓأَيُّهَا ٱلۡكَٰفِرُونَ  لَآ أَعۡبُدُ مَا تَعۡبُدُونَ  وَلَآ أَنتُمۡ عَٰبِدُونَ مَآ أَعۡبُدُ  وَلَآ أَنَا۠ عَابِدٞ مَّا عَبَدتُّمۡ  وَلَآ أَنتُمۡ عَٰبِدُونَ مَآ أَعۡبُدُ  لَكُمۡ دِينُكُمۡ وَلِيَ دِينِ}.
    `,
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "38.mp3"
  },
  {
    caption: '[سورة الإخلاص، آية: 1-4]',
    content: `
    {قُلْ هُوَ اللَّـهُ أَحَدٌ* اللَّـهُ الصَّمَدُ* لَمْ يَلِدْ وَلَمْ يُولَدْ* وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ}.
    `,
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "2.mp3"
  },
  {
    caption: '[سورة الفلق، آية: 1-5]',
    content: `
    {قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ* مِن شَرِّ مَا خَلَقَ* وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ* وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ* وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ}.
    `,
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "3.mp3"
  },
  {
    caption: '[سورة الناس، آية: 1-6]',
    content: `
    {قُلْ أَعُوذُ بِرَبِّ النَّاسِ* مَلِكِ النَّاسِ* إِلَـهِ النَّاسِ* مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ* الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ* مِنَ الْجِنَّةِ وَالنَّاسِ}.
    `,
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "4.mp3"
  },
];

export const noteData = {
  title: 'ضوابط الرقية الشرعية',
  content: `
  يجب أن تكون على وضوء ويفضل التوجه نحو القبلة

  الإعتقاد بأن الله هو شافى وليست الرقية بذاتها فما هي إلا أخذ بلأسباب

  الدعاء لله وبالله وأسمائه فقط، لا باسم النبي أو ملاك أو أحد الأنبياء أو الصالحين
  `,
  contact: `
  هذا التطبيق غير ربحي بالمرة، قمت بتصميمه من أجل استعمال خاص لي فقط، إذ كان هناك أي خطأ أو ملاحظة يمكنكم التواصل معي عبر البريد
  `,
  email: 'mouradbougarne@gmail.com',
};

export const azkarData: DataProps[] = [
  {
    category: CategoryEnum.Morning,
    caption: '[سورة البقرة: 255]',
    content: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم اللّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: '1.mp3'
  },
  {
    category: CategoryEnum.Morning,
    caption: '[سورة الإخلاص]',
    content: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلۡ هُوَ ٱللَّهُ أَحَدٌ ﴿١﴾ ٱللَّهُ ٱلصَّمَدُ ﴿٢﴾ لَمۡ يَلِدۡ وَلَمۡ يُولَدۡ ﴿٣﴾ وَلَمۡ يَكُن لَّهُۥ كُفُوًا أَحَدُۢ ﴿٤﴾",
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: '2.mp3'
  },
  {
    category: CategoryEnum.Morning,
    caption: '[سورة الفلق]',
    content: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ ﴿١﴾ مِن شَرِّ مَا خَلَقَ ﴿٢﴾ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ﴿٣﴾ وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِي ٱلۡعُقَدِ ﴿٤﴾ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ ﴿٥﴾",
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "3.mp3"
  },
  {
    category: CategoryEnum.Morning,
    caption: '[سورة الناس]',
    content: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ ﴿١﴾ مَلِكِ ٱلنَّاسِ ﴿٢﴾ إِلَٰهِ ٱلنَّاسِ ﴿٣﴾ مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ ﴿٤﴾ ٱلَّذِي يُوَسۡوِسُ فِي صُدُورِ ٱلنَّاسِ ﴿٥﴾ مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ ﴿٦﴾",
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "4.mp3"
  },
  {
    category: CategoryEnum.Morning,
    caption: '[رواه مسلم]',
    content: "أَصْبَحْنا وَأَصْبَحَ المُلْكُ لله وَالحَمدُ لله، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، وهُوَ على كلّ شَيءٍ قدير، رَبِّ أسْأَلُكَ خَيرَ ما في هذا اليوم وَخَيرَ ما بَعْدَه، وَأَعوذُ بِكَ مِنْ شَرِّ ما في هذا اليوم وَشَرِّ ما بَعْدَه، رَبِّ أَعوذُ بِكَ مِنَ الْكَسَلِ وَسوءِ الْكِبَر، رَبِّ أَعوذُ بِكَ مِنْ عَذابٍ في النّارِ وَعَذابٍ في القَبْر.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "5.mp3"
  },
  {
    category: CategoryEnum.Morning,
    caption: '[سيد الاستغفار - رواه البخاري]',
    content: "اللّهمَّ أَنْتَ رَبِّي لا إلهَ إلاّ أَنْتَ، خَلَقْتَني وَأَنا عَبْدُك، وَأَنا عَلى عَهْدِكَ وَوَعْدِكَ ما اسْتَطَعْت، أَعوذُبِكَ مِنْ شَرِّ ما صَنَعْت، أَبوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبوءُ بِذَنْبي فَاغْفِرْ لي فَإِنَّهُ لا يَغْفِرُ الذُّنوبَ إِلاّ أَنْتَ.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "6.mp3"
  },
  {
    category: CategoryEnum.Morning,
    caption: '[رواه الترمذي]',
    content: "اللّهُمَّ إِنِّي أَصْبَحْتُ أُشْهِدُك، وَأُشْهِدُ حَمَلَةَ عَرْشِك، وَمَلائِكَتِك، وَجَميعَ خَلْقِك، أَنَّكَ أَنْتَ اللهُ لا إلهَ إلاّ أَنْتَ وَحْدَكَ لا شَريكَ لَك، وَأَنَّ مُحَمّداً عَبْدُكَ وَرَسولُك.",
    repeatDescription: '4 مرات',
    repeat: 4,
    audioFile: "7.mp3"
  },
  {
    category: CategoryEnum.Morning,
    caption: '[رواه أبو داود]',
    content: "اللّهُمَّ ما أَصْبَحَ بي مِنْ نِعْمَةٍ أَو بِأَحَدٍ مِنْ خَلْقِك، فَمِنْكَ وَحْدَكَ لا شريكَ لَك، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْر.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "8.mp3"
  },
  {
    category: CategoryEnum.Morning,
    caption: '[رواه ابن السني]',
    content: "حَسْبِيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَيهِ تَوَكَّلتُ وَهُوَ رَبُّ العَرْشِ العَظيم.",
    repeatDescription: '7 مرات',
    repeat: 7,
    audioFile: "9.mp3"
  },
  {
    category: CategoryEnum.Morning,
    caption: '[رواه أبو داود والترمذي]',
    content: "بِسمِ اللهِ الذي لا يَضُرُّ مَعَ اسمِهِ شَيءٌ في الأرْضِ وَلا في السّماءِ وَهوَ السّميعُ العَليم.",
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "10.mp3"
  },
  {
    category: CategoryEnum.Morning,
    caption: '[رواه الترمذي]',
    content: "اللّهُمَّ بِكَ أَصْبَحْنا وَبِكَ أَمْسَينا، وَبِكَ نَحْيا وَبِكَ نَمُوتُ وَإِلَيْكَ النُّشُور.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "11.mp3"
  },
  {
    category: CategoryEnum.Morning,
    caption: '[رواه أحمد]',
    content: "أَصْبَحْنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "12.mp3"
  },
  {
    category: CategoryEnum.Morning,
    caption: '[رواه الحاكم]',
    content: "سُبْحانَ اللهِ وَبِحَمْدِهِ عَدَدَ خَلْقِه، وَرِضا نَفْسِه، وَزِنَةَ عَرْشِه، وَمِدادَ كَلِماتِه.",
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "13.mp3"
  },
  {
    category: CategoryEnum.Morning,
    caption: '[رواه الترمذي]',
    content: "يا حَيُّ يا قَيّومُ بِرَحْمَتِكِ أَسْتَغيث، أَصْلِحْ لي شَأْني كُلَّه، وَلا تَكِلني إِلى نَفْسي طَرْفَةَ عَيْن.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "17.mp3"
  },
  {
    category: CategoryEnum.Morning,
    caption: '[رواه أبو داود]',
    content: "اللّهُمَّ عافِني في بَدَني، اللّهُمَّ عافِني في سَمْعي، اللّهُمَّ عافِني في بَصَري، لا إلهَ إلاّ أَنْتَ.",
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "14.mp3"

  },
  {
    category: CategoryEnum.Morning,
    caption: '[رواه النسائي]',
    content: " اللّهُمَّ إِنّي أَعوذُ بِكَ مِنَ الْكُفْر، وَالفَقْر، وَأَعوذُ بِكَ مِنْ عَذابِ القَبْر، لا إلهَ إلاّ أَنْتَ.",
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "15.mp3"

  },
  {
    category: CategoryEnum.Morning,
    caption: '[رواه البخاري ومسلم]',
    content: "لا إلهَ إلاّ اللّهُ وحْدَهُ لا شَريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، وهُوَ على كُلّ شَيءٍ قَدير.",
    repeatDescription: '100 مرة',
    repeat: 100,
    audioFile: "28.mp3"
  },
  {
    category: CategoryEnum.Morning,
    caption: '[رواه مسلم]',
    content: "سُبْحانَ اللهِ وَبِحَمْدِهِ.",
    repeatDescription: '100 مرة',
    repeat: 100,
    audioFile: "29.mp3"
  },
  {
    category: CategoryEnum.Morning,
    caption: '[رواه البخاري ومسلم]',
    content: "أَسْتَغْفِرُ اللهَ وَأَتُوبُ إِلَيْهِ.",
    repeatDescription: '100 مرة',
    repeat: 100,
    audioFile: "30.mp3"
  },
  {
    category: CategoryEnum.Morning,
    caption: '[رواه الطبراني]',
    content: "اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى نَبِيِّنَا مُحمَّد.",
    repeatDescription: '10 مرات',
    repeat: 10,
    audioFile: "21.mp3"
  },
  // ==========================================
  // أذكار المساء (Night)
  // ==========================================
  {
    category: CategoryEnum.Night,
    caption: '[سورة البقرة: 255]',
    content: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم اللّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "1.mp3"
  },
  {
    category: CategoryEnum.Night,
    caption: '[سورة الإخلاص]',
    content: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلۡ هُوَ ٱللَّهُ أَحَدٌ ﴿١﴾ ٱللَّهُ ٱلصَّمَدُ ﴿٢﴾ لَمۡ يَلِدۡ وَلَمۡ يُولَدۡ ﴿٣﴾ وَلَمۡ يَكُن لَّهُۥ كُفُوًا أَحَدُۢ ﴿٤﴾",
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "2.mp3"
  },
  {
    category: CategoryEnum.Night,
    caption: '[سورة الفلق]',
    content: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ ﴿١﴾ مِن شَرِّ مَا خَلَقَ ﴿٢﴾ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ﴿٣﴾ وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِي ٱلۡعُقَدِ ﴿٤﴾ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ ﴿٥﴾",
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "3.mp3"
  },
  {
    category: CategoryEnum.Night,
    caption: '[سورة الناس]',
    content: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ ﴿١﴾ مَلِكِ ٱلنَّاسِ ﴿٢﴾ إِلَٰهِ ٱلنَّاسِ ﴿٣﴾ مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ ﴿٤﴾ ٱلَّذِي يُوَسۡوِسُ فِي صُدُورِ ٱلنَّاسِ ﴿٥﴾ مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ ﴿٦﴾",
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "4.mp3"
  },
  {
    category: CategoryEnum.Night,
    caption: '[رواه مسلم]',
    content: "أَمْسَيْنا وَأَمْسَى المُلْكُ لله وَالحَمدُ لله، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، وهُوَ على كلّ شَيءٍ قدير، رَبِّ أسْأَلُكَ خَيرَ ما في هذهِ اللَّيْلَةِ وَخَيرَ ما بَعْدَها، وَأَعوذُ بِكَ مِنْ شَرِّ ما في هذهِ اللَّيْلَةِ وَشَرِّ ما بَعْدَها، رَبِّ أَعوذُ بِكَ مِنَ الْكَسَلِ وَسوءِ الْكِبَر، رَبِّ أَعوذُ بِكَ مِنْ عَذابٍ في النّارِ وَعَذابٍ في القَبْر.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "32.mp3"
  },
  {
    category: CategoryEnum.Night,
    caption: '[رواه البخاري]',
    content: "اللّهمَّ أَنْتَ رَبِّي لا إلهَ إلاّ أَنْتَ، خَلَقْتَني وَأَنا عَبْدُك، وَأَنا عَلى عَهْدِكَ وَوَعْدِكَ ما اسْتَطَعْت، أَعوذُبِكَ مِنْ شَرِّ ما صَنَعْت، أَبوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبوءُ بِذَنْبي فَاغْفِرْ لي فَإِنَّهُ لا يَغْفِرُ الذُّنوبَ إِلاّ أَنْتَ.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "6.mp3"
  },
  {
    category: CategoryEnum.Night,
    caption: '[رواه الترمذي]',
    content: "اللّهُمَّ إِنِّي أَمْسَيْتُ أُشْهِدُك، وَأُشْهِدُ حَمَلَةَ عَرْشِك، وَمَلائِكَتِك، وَجَميعَ خَلْقِك، أَنَّكَ أَنْتَ اللهُ لا إلهَ إلاّ أَنْتَ وَحْدَكَ لا شَريكَ لَك، وَأَنَّ مُحَمّداً عَبْدُكَ وَرَسولُك.",
    repeatDescription: '4 مرات',
    repeat: 4,
    audioFile: "33.mp3"
  },
  {
    category: CategoryEnum.Night,
    caption: '[رواه أبو داود]',
    content: "اللّهُمَّ ما أَمْسَى بي مِنْ نِعْمَةٍ أَو بِأَحَدٍ مِنْ خَلْقِك، فَمِنْكَ وَحْدَكَ لا شريكَ لَك، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْر.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "34.mp3"
  },
  {
    category: CategoryEnum.Night,
    caption: '[رواه ابن السني]',
    content: "حَسْبِيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَيهِ تَوَكَّلتُ وَهُوَ رَبُّ العَرْشِ العَظيم.",
    repeatDescription: '7 مرات',
    repeat: 7,
    audioFile: "9.mp3"
  },
  {
    category: CategoryEnum.Night,
    caption: '[رواه أبو داود والترمذي]',
    content: "بِسمِ اللهِ الذي لا يَضُرُّ مَعَ اسمِهِ شَيءٌ في الأرْضِ وَلا في السّماءِ وَهوَ السّميعُ العَليم.",
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "10.mp3"
  },
  {
    category: CategoryEnum.Night,
    caption: '[رواه الترمذي]',
    content: "اللّهُمَّ بِكَ أَمْسَينا وَبِكَ أَصْبَحْنا، وَبِكَ نَحْيا وَبِكَ نَمُوتُ وَإِلَيْكَ المَصِير.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "35.mp3"
  },
  {
    category: CategoryEnum.Night,
    caption: '[رواه الترمذي]',
    content: "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ.",
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "20.mp3"
  },
  {
    category: CategoryEnum.Night,
    caption: '[رواه أحمد]',
    content: "أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "36.mp3"
  },
  {
    category: CategoryEnum.Night,
    caption: '[رواه الترمذي]',
    content: "يا حَيُّ يا قَيّومُ بِرَحْمَتِكِ أَسْتَغيث، أَصْلِحْ لي شَأْني كُلَّه، وَلا تَكِلني إِلى نَفْسي طَرْفَةَ عَيْن.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "17.mp3"
  },
  {
    category: CategoryEnum.Morning,
    caption: '[رواه أبو داود]',
    content: "اللّهُمَّ عافِني في بَدَني، اللّهُمَّ عافِني في سَمْعي، اللّهُمَّ عافِني في بَصَري، لا إلهَ إلاّ أَنْتَ.",
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "14.mp3"

  },
  {
    category: CategoryEnum.Morning,
    caption: '[رواه النسائي]',
    content: " اللّهُمَّ إِنّي أَعوذُ بِكَ مِنَ الْكُفْر، وَالفَقْر، وَأَعوذُ بِكَ مِنْ عَذابِ القَبْر، لا إلهَ إلاّ أَنْتَ.",
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "15.mp3"

  },
  {
    category: CategoryEnum.Night,
    caption: '[رواه البخاري ومسلم]',
    content: "لا إلهَ إلاّ اللّهُ وحْدَهُ لا شَريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، وهُوَ على كُلّ شَيءٍ قَدير.",
    repeatDescription: '100 مرة',
    repeat: 100,
    audioFile: "28.mp3"
  },
  {
    category: CategoryEnum.Night,
    caption: '[رواه مسلم]',
    content: "سُبْحانَ اللهِ وَبِحَمْدِهِ.",
    repeatDescription: '100 مرة',
    repeat: 100,
    audioFile: "29.mp3"
  },
  {
    category: CategoryEnum.Night,
    caption: '[رواه البخاري ومسلم]',
    content: "أَسْتَغْفِرُ اللهَ وَأَتُوبُ إِلَيْهِ.",
    repeatDescription: '100 مرة',
    repeat: 100,
    audioFile: "30.mp3"
  },
  {
    category: CategoryEnum.Night,
    caption: '[رواه الطبراني]',
    content: "اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى نَبِيِّنَا مُحمَّد.",
    repeatDescription: '10 مرات',
    repeat: 10,
    audioFile: "21.mp3"
  },

  // ==========================================
  // أذكار النوم (Before Sleep)
  // ==========================================
  {
    category: CategoryEnum.BeforeSleep,
    caption: '[سورة البقرة: 255]',
    content: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "1.mp3"
  },
  {
    category: CategoryEnum.BeforeSleep,
    caption: '[سورة البقرة: 285-286]',
    content: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آمَنَ بِاللَّهِ وَمَلآئِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لاَ نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ وَقَالُواْ سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ* لاَ يُكَلِّفُ اللَّهُ نَفْساً إِلاَّ وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لاَ تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلاَ تَحْمِلْ عَلَيْنَا إِصْراً كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا وَلاَ تُحَمِّلْنَا مَا لاَ طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَآ أَنتَ مَوْلاَنَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "37.mp3"
  },
  {
    category: CategoryEnum.BeforeSleep,
    caption: '[رواه البخاري]',
    content: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلۡ هُوَ ٱللَّهُ أَحَدٌ ﴿١﴾ ٱللَّهُ ٱلصَّمَدُ ﴿٢﴾ لَمۡ يَلِدۡ وَلَمۡ يُولَدۡ ﴿٣﴾ وَلَمۡ يَكُن لَّهُۥ كُفُوًا أَحَدُۢ ﴿٤﴾",
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "2.mp3",
    note: "يَجْمَعُ كَفَّيْهِ ثُمَّ يَنْفُثُ فِيهِمَا فَيَقْرَأُ فِيهِمَا",
    isStacked: true,
  },
  {
    category: CategoryEnum.Night,
    caption: '[سورة الفلق]',
    content: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ ﴿١﴾ مِن شَرِّ مَا خَلَقَ ﴿٢﴾ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ﴿٣﴾ وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِي ٱلۡعُقَدِ ﴿٤﴾ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ ﴿٥﴾",
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "3.mp3",
    note: "يَجْمَعُ كَفَّيْهِ ثُمَّ يَنْفُثُ فِيهِمَا فَيَقْرَأُ فِيهِمَا",
    isStacked: true,
  },
  {
    category: CategoryEnum.Night,
    caption: '[سورة الناس]',
    content: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ ﴿١﴾ مَلِكِ ٱلنَّاسِ ﴿٢﴾ إِلَٰهِ ٱلنَّاسِ ﴿٣﴾ مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ ﴿٤﴾ ٱلَّذِي يُوَسۡوِسُ فِي صُدُورِ ٱلنَّاسِ ﴿٥﴾ مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ ﴿٦﴾",
    repeatDescription: '3 مرات',
    repeat: 3,
    audioFile: "4.mp3",
    note: "يَجْمَعُ كَفَّيْهِ ثُمَّ يَنْفُثُ فِيهِمَا فَيَقْرَأُ فِيهِمَا",
    isStacked: true,
  },
  {
    category: CategoryEnum.BeforeSleep,
    caption: '[رواه البخاري ومسلم]',
    content: "بِاسْمِكَ رَبِّـي وَضَعْـتُ جَنْـبي، وَبِكَ أَرْفَعُـه، فَإِن أَمْسَـكْتَ نَفْسـي فارْحَـمْها ، وَإِنْ أَرْسَلْتَـها فاحْفَظْـها بِمـا تَحْفَـظُ بِه عِبـادَكَ الصّـالِحـين.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "39.mp3"
  },
  {
    category: CategoryEnum.BeforeSleep,
    caption: '[رواه البخاري ومسلم]',
    content: "اللَّهُمَّ إِنَّكَ خَلَقْتَ نَفْسِي وَأَنْتَ تَوَفَّاهَا، لَكَ مَمَاتُهَا وَمَحْيَاهَا، إِنْ أَحْيَيْتَهَا فَاحْفَظْهَا، وَإِنْ أَمَتَّهَا فَاغْفِرْ لَهَا، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "40.mp3"
  },
  {
    category: CategoryEnum.BeforeSleep,
    caption: '[رواه أبو داود]',
    content: "اللَّهُمَّ قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "49.mp3"
  },
  {
    category: CategoryEnum.BeforeSleep,
    caption: '[رواه البخاري ومسلم]',
    content: "بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَأَحْيَا.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "42.mp3"
  },
  {
    category: CategoryEnum.BeforeSleep,
    caption: '[رواه مسلم]',
    content: "الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا، وَكَفَانَا، وَآوَانَا، فَكَمْ مِمَّنْ لا كَافِيَ لَهُ وَلا مُؤْوِيَ.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "45.mp3"
  },
  {
    category: CategoryEnum.BeforeSleep,
    caption: '[رواه البخاري ومسلم]',
    content: "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ وَرَبَّ الأَرْضِ، وَرَبَّ الْعَرْشِ الْعَظِيمِ، رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ، فَالِقَ الْحَبِّ وَالنَّوَى، وَمُنْزِلَ التَّوْرَاةِ وَالْإِنْجِيلِ، وَالْفُرْقَانِ، أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ شَيْءٍ أَنْتَ آخِذٌ بِنَاصِيَتِهِ. اللَّهُمَّ أَنْتَ الأَوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ، وَأَنْتَ الآخِرُ فَلَيسَ بَعْدَكَ شَيْءٌ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ، اقْضِ عَنَّا الدَّيْنَ وَأَغْنِنَا مِنَ الْفَقْرِ.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "44.mp3"
  },
  {
    category: CategoryEnum.BeforeSleep,
    caption: '[رواه مسلم]',
    content: "اللَّهُمَّ عَالِمَ الغَيْبِ وَالشَّهَادَةِ، فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "46.mp3"
  },
  {
    category: CategoryEnum.BeforeSleep,
    caption: '[سورة السجدة وسورة الملك]',
    content: "قراءة سورة السجدة وسورة الملك.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioArray: [
      {
        fileName: 'sajda.mp3',
        title: 'سورة السجدة',
      },
      {
        fileName: 'almulk.mp3',
        title: 'سورة الملك',
      }
    ]
  },
  {
    category: CategoryEnum.BeforeSleep,
    caption: '[رواه البخاري ومسلم]',
    content: "سُبْحَانَ اللَّهِ (33)، وَالْحَمْدُ لِلَّهِ (33)، وَاللَّهُ أَكْبَرُ (34).",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "43.mp3"
  },
  {
    category: CategoryEnum.BeforeSleep,
    caption: '[رواه البخاري ومسلم]',
    content: "اللَّهُمَّ أَسْلَمْتُ نَفْسِي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ، وَوَجَّهْتُ وَجْهِي إِلَيْكَ، وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لَا مَلْجَأَ وَلَا مَنْجَا مِنْكَ إِلَّا إِلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ، وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ.",
    repeatDescription: 'مرة واحدة',
    repeat: 1,
    audioFile: "47.mp3"
  }
];