/* eslint-disable prettier/prettier */
export type DataProps = {
  caption?: string;
  content?: string;
  repeatDescription? : string;
  repeat?: number;
}

export const data: DataProps[] = [
  {
    caption: '[حديث]',
    content: 'بسم الله توكلت على الله ولا حول ولا قوة إلا بالله',
    repeatDescription: '3 مرات',
    repeat: 3,
  },
  {
    caption: '[حديث]',
    content: 'اللهم صل على محمد وعلى آل محمد كما صليت على إبراهيم وعلى آل إبراهيم وبارك على محمد وعلى آل محمد كما باركت على إبراهيم وعلى آل ابراهيم في العالمين إنك حميد مجيد',
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[حديث]',
    content: 'حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم',
    repeatDescription: '7 مرات',
    repeat: 7,
  },
  {
    caption: '[حديث]',
    content: 'بسم الله الذي لا يضر مع اسمه شيء في الارض ولا في السماء وهو السميع العليم',
    repeatDescription: '3 مرات',
    repeat: 3,
  },
  {
    caption: '[حديث]',
    content: 'اللهم رب الناس أذهب الباس إشفِ أنت الشافي لا شفاء إلا شفاءك شفاءً لا يغادر سقما',
    repeatDescription: '3 مرات',
    repeat: 3,
  },
  {
    caption: '[حديث]',
    content: 'بسم الله ارقيك، من كل شيء يؤذيك، من شر كل نفس أو عين حاسد، الله يشفيك، بسم الله ارقيك',
    repeatDescription: '3 مرات',
    repeat: 3,
  },
  {
    caption: '[الأذان]',
    content: 'الله أكبر، الله أكبر، الله أكبر، الله أكبر، أشهد أن لا إله إلا الله، أشهد أن لا إله إلا الله، أشهد أن محمدًا رسولُ الله، أشهد أن محمدًا رسولُ الله، حيَّ على الصلاة، حيَّ على الصلاة، حيَّ على الفلاح، حيَّ على الفلاح، الله أكبر، الله أكبر، لا إله إلا الله',
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة الفاتحة، آية: 1-7]',
    content: `
    {بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ* الْحَمْدُ لِلَّـهِ رَبِّ الْعَالَمِينَ* الرَّحْمَـٰنِ الرَّحِيمِ* مَالِكِ يَوْمِ الدِّينِ* إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ* اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ* صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ}.
    `,
    repeatDescription: '3 مرات',
    repeat: 3,
  },
  {
    caption: '[سورة البقرة، آية: 1-5]',
    content: `
    {الم* ذَٰلِكَ الْكِتَابُ لَا رَيْبَ ۛ فِيهِ ۛ هُدًى لِّلْمُتَّقِينَ* الَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ وَيُقِيمُونَ الصَّلَاةَ وَمِمَّا رَزَقْنَاهُمْ يُنفِقُونَ* وَالَّذِينَ يُؤْمِنُونَ بِمَا أُنزِلَ إِلَيْكَ وَمَا أُنزِلَ مِن قَبْلِكَ وَبِالْآخِرَةِ هُمْ يُوقِنُونَ* أُولَـٰئِكَ عَلَىٰ هُدًى مِّن رَّبِّهِمْ ۖ وَأُولَـٰئِكَ هُمُ الْمُفْلِحُونَ}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة البقرة، آية: 255]',
    content: `
    {اللَّـهُ لَا إِلَـٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ}.
    `,
    repeatDescription: '3 مرات',
    repeat: 3,
  },
  {
    caption: '[سورة البقرة، آية: 102]',
    content: `
    {وَاتَّبَعُوا مَا تَتْلُو الشَّيَاطِينُ عَلَىٰ مُلْكِ سُلَيْمَانَ وَمَا كَفَرَ سُلَيْمَانُ وَلَـٰكِنَّ الشَّيَاطِينَ كَفَرُوا يُعَلِّمُونَ النَّاسَ السِّحْرَ وَمَا أُنزِلَ عَلَى الْمَلَكَيْنِ بِبَابِلَ هَارُوتَ وَمَارُوتَ وَمَا يُعَلِّمَانِ مِنْ أَحَدٍ حَتَّى يَقُولَا إِنَّمَا نَحْنُ فِتْنَةٌ فَلَا تَكْفُرْ فَيَتَعَلَّمُونَ مِنْهُمَا مَا يُفَرِّقُونَ بِهِ بَيْنَ الْمَرْءِ وَزَوْجِهِ وَمَا هُم بِضَارِّينَ بِهِ مِنْ أَحَدٍ إِلَّا بِإِذْنِ اللَّـهِ وَيَتَعَلَّمُونَ مَا يَضُرُّهُمْ وَلَا يَنفَعُهُمْ وَلَقَدْ عَلِمُوا لَمَنِ اشْتَرَاهُ مَا لَهُ فِي الْآخِرَةِ مِنْ خَلَاقٍ وَلَبِئْسَ مَا شَرَوْا بِهِ أَنفُسَهُمْ لَوْ كَانُوا يَعْلَمُونَ}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة البقرة، آية: 285-286]',
    content: `
    {آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ وَقَالُوا سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ ۝ لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة آل عمران، آية: 1-5]',
    content: `
    {الم* اللَّـهُ لَا إِلَـٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ* نَزَّلَ عَلَيْكَ الْكِتَابَ بِالْحَقِّ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ وَأَنزَلَ التَّوْرَاةَ وَالْإِنجِيلَ*مِن قَبْلُ هُدًى لِّلنَّاسِ وَأَنزَلَ الْفُرْقَانَ إِنَّ الَّذِينَ كَفَرُوا بِآيَاتِ اللَّـهِ لَهُمْ عَذَابٌ شَدِيدٌ وَاللَّـهُ عَزِيزٌ ذُو انتِقَامٍ* إِنَّ اللَّـهَ لَا يَخْفَىٰ عَلَيْهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة آل عمران، آية: 26-27]',
    content: `
    {قُلِ اللَّـهُمَّ مَالِكَ الْمُلْكِ تُؤْتِي الْمُلْكَ مَن تَشَاءُ وَتَنزِعُ الْمُلْكَ مِمَّن تَشَاءُ وَتُعِزُّ مَن تَشَاءُ وَتُذِلُّ مَن تَشَاءُ بِيَدِكَ الْخَيْرُ إِنَّكَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ* تُولِجُ اللَّيْلَ فِي النَّهَارِ وَتُولِجُ النَّهَارَ فِي اللَّيْلِ وَتُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ وَتُخْرِجُ الْمَيِّتَ مِنَ الْحَيِّ وَتَرْزُقُ مَن تَشَاءُ بِغَيْرِ حِسَابٍ}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة الأعراف، آية: 117-122]',
    content: `
    {وَأَوحَينا إِلى موسى أَن أَلقِ عَصاكَ فَإِذا هِيَ تَلقَفُ ما يَأفِكونَ* فَوَقَعَ الحَقُّ وَبَطَلَ ما كانوا يَعمَلونَ*فَغُلِبوا هُنالِكَ وَانقَلَبوا صاغِرينَ* وَأُلقِيَ السَّحَرَةُ ساجِدينَ*قالوا آمَنّا بِرَبِّ العالَمينَ* رَبِّ موسى وَهارونَ}.
    `,
    repeatDescription: '3 مرات',
    repeat: 3,
  },
  {
    caption: '[طه 69]',
    content: `
    وَأَلْقِ مَا فِي يَمِينِكَ تَلْقَفْ مَا صَنَعُوا إِنَّمَا صَنَعُوا كَيْدُ سَاحِرٍ وَلَا يُفْلِحُ السَّاحِرُ حَيْثُ أَتَى
    `,
    repeatDescription: '3 مرات',
    repeat: 3,
  },
  {
    caption: '[سورة يونس، آية: 79-82]',
    content: `
    {وَقالَ فِرعَونُ ائتوني بِكُلِّ ساحِرٍ عَليمٍ* فَلَمّا جاءَ السَّحَرَةُ قالَ لَهُم موسى أَلقوا ما أَنتُم مُلقونَ* فَلَمّا أَلقَوا قالَ موسى ما جِئتُم بِهِ السِّحرُ إِنَّ اللَّـهَ سَيُبطِلُهُ إِنَّ اللَّـهَ لا يُصلِحُ عَمَلَ المُفسِدينَ* وَيُحِقُّ اللَّـهُ الحَقَّ بِكَلِماتِهِ وَلَو كَرِهَ المُجرِمونَ}.
    `,
    repeatDescription: '3 مرات',
    repeat: 3,
  },
  {
    caption: '[سورة المؤمنون، آية: 97-98]',
    content: `
    {وَقُل رَّبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ* وَأَعُوذُ بِكَ رَبِّ أَن يَحْضُرُونِ}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[الأنبياء 8]',
    content: `
    وَذَا النُّونِ إِذ ذَّهَبَ مُغَاضِبًا فَظَنَّ أَن لَّن نَّقْدِرَ عَلَيْهِ فَنَادَى فِي الظُّلُمَاتِ أَن لَّا إِلَهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ . فَاسْتَجَبْنَا لَهُ وَنَجَّيْنَاهُ مِنَ الْغَمِّ وَكَذَلِكَ نُنجِي الْمُؤْمِنِينَ
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[الأنبياء 83]',
    content: `
    وَأَيُّوبَ إِذْ نَادَى رَبَّهُ أَنِّي مَسَّنِيَ الضُّرُّ وَأَنتَ أَرْحَمُ الرَّاحِمِين فَاسْتَجَبْنَا لَهُ فَكَشَفْنَا مَا بِهِ مِن ضُرٍّ وَآتَيْنَاهُ أَهْلَهُ وَمِثْلَهُم مَّعَهُمْ رَحْمَةً مِّنْ عِندِنَا وَذِكْرَى لِلْعَابِدِينَ
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[مريم – 68 ، 72]',
    content: `
    فَوَرَبِّكَ لَنَحْشُرَنَّهُمْ وَالشَّيَاطِينَ ثُمَّ لَنُحْضِرَنَّهُمْ حَوْلَ جَهَنَّمَ جِثِيًّا * ثُمَّ لَنَنزِعَنَّ مِنْ كُلِّ شِيعَـــةٍ أَيُّهُـــمْ أَشَــدُّ عَلَى الرَّحْمَنِ عِتِيـًّا * ثُـمَّ لَنَحـْنُ أَعْلَـمُ بِالَّذِينَ هُـمْ أَوْلَى بِهَا صِلِيـًّا * وَإِنْ مِنْكُـمْ إِلا وَارِدُهَا كَانَ عَلَى رَبِّكَ حَتْمًا مَقْضِيًّا * ثُمَّ نُنَجِّى الَّذِينَ اتَّقَوْا وَنَذَرُ الظَّالِمِينَ فِيهَا جِثِيًّا
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[إبراهيم – 15 ، 17]',
    content: `
    وَاسْتَفْتَحُوا وَخَابَ كُلُّ جَبَّارٍ عَنِيدٍ * مِنْ وَرَائِهِ جَهَنَّمُ وَيُسْقَى مِنْ مَاءٍ صَدِيدٍ * يَتَجَرَّعُهُ وَلا يَكَادُ يُسِيغُهُ وَيَأْتِيهِ الْمَوْتُ مِنْ كُلِّ مَكَانٍ وَمَا هُوَ بِمَيِّتٍ وَمِنْ وَرَائِهِ عَذَابٌ غَلِيظٌ
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[غافر : 44]',
    content: `
    وَأُفَوِّضُ أَمْرِي إِلَى اللَّهِ إِنَّ اللَّهَ بَصِيرٌ بِالْعِبَادِ . فَوَقَاهُ اللَّهُ سَيِّئَاتِ مَا مَكَرُوا وَحَاقَ بِآلِ فِرْعَوْنَ سُوءُ الْعَذَابِ
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة الإسراء، آية: 80-82]',
    content: `
    {وَقُل رَبِّ أَدخِلني مُدخَلَ صِدقٍ وَأَخرِجني مُخرَجَ صِدقٍ وَاجعَل لي مِن لَدُنكَ سُلطانًا نَصيرًا* وَقُل جاءَ الحَقُّ وَزَهَقَ الباطِلُ إِنَّ الباطِلَ كانَ زَهوقًا* وَنُنَزِّلُ مِنَ القُرآنِ ما هُوَ شِفاءٌ وَرَحمَةٌ لِلمُؤمِنينَ وَلا يَزيدُ الظّالِمينَ إِلّا خَسارًا}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة النور، آية، 35]',
    content: `
    {اللَّـهُ نُورُ السَّمَاوَاتِ وَالْأَرْضِ مَثَلُ نُورِهِ كَمِشْكَاةٍ فِيهَا مِصْبَاحٌ الْمِصْبَاحُ فِي زُجَاجَةٍ الزُّجَاجَةُ كَأَنَّهَا كَوْكَبٌ دُرِّيٌّ يُوقَدُ مِن شَجَرَةٍ مُّبَارَكَةٍ زَيْتُونَةٍ لَّا شَرْقِيَّةٍ وَلَا غَرْبِيَّةٍ يَكَادُ زَيْتُهَا يُضِيءُ وَلَوْ لَمْ تَمْسَسْهُ نَارٌ نُّورٌ عَلَى نُورٍ يَهْدِي اللَّـهُ لِنُورِهِ مَن يَشَاءُ وَيَضْرِبُ اللَّـهُ الْأَمْثَالَ لِلنَّاسِ وَاللَّـهُ بِكُلِّ شَيْءٍ عَلِيمٌ}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة يس، آية: 1-9]',
    content: `
    {يس* وَالْقُرْآنِ الْحَكِيمِ* إِنَّكَ لَمِنَ الْمُرْسَلِينَ* عَلَى صِرَاطٍ مُّسْتَقِيمٍ* تَنزِيلَ الْعَزِيزِ الرَّحِيمِ* لِتُنذِرَ قَوْمًا مَّا أُنذِرَ آبَاؤُهُمْ فَهُمْ غَافِلُونَ* لَقَدْ حَقَّ الْقَوْلُ عَلَى أَكْثَرِهِمْ فَهُمْ لَا يُؤْمِنُونَ* إِنَّا جَعَلْنَا فِي أَعْنَاقِهِمْ أَغْلاَلاً فَهِيَ إِلَى الأَذْقَانِ فَهُم مُّقْمَحُونَ* وَجَعَلْنَا مِن بَيْنِ أَيْدِيهِمْ سَدًّا وَمِنْ خَلْفِهِمْ سَدًّا فَأَغْشَيْنَاهُمْ فَهُمْ لاَ يُبْصِرُونَ}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة الصافات، آية: 1-18]',
    content: `
    {وَالصَّافَّاتِ صَفًّا* فَالزَّاجِرَاتِ زَجْرًا* فَالتَّالِيَاتِ ذِكْرًا* إِنَّ إِلَٰهَكُمْ لَوَاحِدٌ* رَّبُّ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا وَرَبُّ الْمَشَارِقِ* إِنَّا زَيَّنَّا السَّمَاءَ الدُّنْيَا بِزِينَةٍ الْكَوَاكِبِ* وَحِفْظًا مِّن كُلِّ شَيْطَانٍ مَّارِدٍ* لَّا يَسَّمَّعُونَ إِلَى الْمَلَإِ الْأَعْلَى وَيُقْذَفُونَ مِن كُلِّ جَانِبٍ* دُحُورًا ۖ وَلَهُمْ عَذَابٌ وَاصِبٌ* إِلَّا مَنْ خَطِفَ الْخَطْفَةَ فَأَتْبَعَهُ شِهَابٌ ثَاقِبٌ* فَاسْتَفْتِهِمْ أَهُمْ أَشَدُّ خَلْقًا أَم مَّنْ خَلَقْنَا ۚ إِنَّا خَلَقْنَاهُم مِّن طِينٍ لَّازِبٍ* بَلْ عَجِبْتَ وَيَسْخَرُونَ* وَإِذَا ذُكِّرُوا لَا يَذْكُرُونَ* وَإِذَا رَأَوْا آيَةً يَسْتَسْخِرُونَ* وَقَالُوا إِنْ هَٰذَا إِلَّا سِحْرٌ مُّبِينٌ* أَإِذَا مِتْنَا وَكُنَّا تُرَابًا وَعِظَامًا أَإِنَّا لَمَبْعُوثُونَ* أَوَآبَاؤُنَا الْأَوَّلُونَ* قُلْ نَعَمْ وَأَنتُمْ دَاخِرُونَ}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة الجن، آية: 1-9]',
    content: `
    {قُلْ أُوحِيَ إِلَيَّ أَنَّهُ اسْتَمَعَ نَفَرٌ مِّنَ الْجِنِّ فَقَالُوا إِنَّا سَمِعْنَا قُرْآنًا عَجَبًا* يَهْدِي إِلَى الرُّشْدِ فَآمَنَّا بِهِ ۖ وَلَن نُّشْرِكَ بِرَبِّنَا أَحَدًا* وَأَنَّهُ تَعَالَىٰ جَدُّ رَبِّنَا مَا اتَّخَذَ صَاحِبَةً وَلَا وَلَدًا* وَأَنَّهُ كَانَ يَقُولُ سَفِيهُنَا عَلَى اللهِ شَطَطًا* وَأَنَّا ظَنَنَّا أَن لَّن تَقُولَ الْإِنسُ وَالْجِنُّ عَلَى اللهِ كَذِبًا* وَأَنَّهُ كَانَ رِجَالٌ مِّنَ الْإِنسِ يَعُوذُونَ بِرِجَالٍ مِّنَ الْجِنِّ فَزَادُوهُمْ رَهَقًا* وَأَنَّهُمْ ظَنُّوا كَمَا ظَنَنتُمْ أَن لَّن يَبْعَثَ اللهُ أَحَدًا* وَأَنَّا لَمَسْنَا السَّمَاءَ فَوَجَدْنَاهَا مُلِئَتْ حَرَسًا شَدِيدًا وَشُهُبًا* وَأَنَّا كُنَّا نَقْعُدُ مِنْهَا مَقَاعِدَ لِلسَّمْعِ ۖ فَمَن يَسْتَمِعِ الْآنَ يَجِدْ لَهُ شِهَابًا رَّصَدًا}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة الشرح، آية: 1-8]',
    content: `
    {أَلَمْ نَشْرَحْ لَكَ صَدْرَكَ* وَوَضَعْنَا عَنكَ وِزْرَكَ* الَّذِي أَنقَضَ ظَهْرَكَ* وَرَفَعْنَا لَكَ ذِكْرَكَ* فَإِنَّ مَعَ الْعُسْرِ يُسْرًا* إِنَّ مَعَ الْعُسْرِ يُسْرًا* فَإِذَا فَرَغْتَ فَانصَبْ* وَإِلَى رَبِّكَ فَارْغَب}.
    `,
    repeatDescription: 'مرة واحدة',
    repeat: 1,
  },
  {
    caption: '[سورة الكافرون، آية: 1-6]',
    content: `
    {قُلۡ يَٰٓأَيُّهَا ٱلۡكَٰفِرُونَ  لَآ أَعۡبُدُ مَا تَعۡبُدُونَ  وَلَآ أَنتُمۡ عَٰبِدُونَ مَآ أَعۡبُدُ  وَلَآ أَنَا۠ عَابِدٞ مَّا عَبَدتُّمۡ  وَلَآ أَنتُمۡ عَٰبِدُونَ مَآ أَعۡبُدُ  لَكُمۡ دِينُكُمۡ وَلِيَ دِينِ}.
    `,
    repeatDescription: '3 مرات',
    repeat: 3,
  },
  {
    caption: '[سورة الإخلاص، آية: 1-4]',
    content: `
    {قُلْ هُوَ اللَّـهُ أَحَدٌ* اللَّـهُ الصَّمَدُ* لَمْ يَلِدْ وَلَمْ يُولَدْ* وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ}.
    `,
    repeatDescription: '3 مرات',
    repeat: 3,
  },
  {
    caption: '[سورة الفلق، آية: 1-5]',
    content: `
    {قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ* مِن شَرِّ مَا خَلَقَ* وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ* وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ* وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ}.
    `,
    repeatDescription: '3 مرات',
    repeat: 3,
  },
  {
    caption: '[سورة الناس، آية: 1-6]',
    content: `
    {قُلْ أَعُوذُ بِرَبِّ النَّاسِ* مَلِكِ النَّاسِ* إِلَـهِ النَّاسِ* مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ* الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ* مِنَ الْجِنَّةِ وَالنَّاسِ}.
    `,
    repeatDescription: '3 مرات',
    repeat: 3,
  },
];
